import React, { Component } from "react";
import {
    Container, Header, Title, Button, Left, Right, Body, Icon, Col, Row, Content, Text, Card, CardItem
} from "native-base";
import { ScrollView } from "react-native";
import AsyncStorage from '@react-native-community/async-storage';

export default class BlogPage extends Component {
    constructor(props) {
        super(props);

        this.state = {
            spinner: false,
            username: "",
            password: "",
            isLoading: false,
            hidePassword: true,
            options: ''
        };
        this.inputs = {};
    }

    logout = async () => {
        await AsyncStorage.removeItem("isLogin");
        this.props.navigation.navigate("AppLogin")
    }


    render() {

        return (
            <Container>
                <Header style={{ backgroundColor: 'green' }}>
                    <Left style={{ flex: 1 }}>
                        <Button transparent>
                            <Icon name='md-arrow-back' onPress={() => this.props.navigation.navigate("HomePage")} />
                        </Button>
                    </Left>
                    <Body style={{ flex: 1 }}>
                        <Title>ছাদ বাগান তৈরি!</Title>
                    </Body>
                    <Right style={{ flex: 1 }}>
                        <Icon name='exit' onPress={this.logout} />
                    </Right>
                </Header>
                <Content style={{margin: 10}}>
                    <Text>
                        ছাদ বাগান
                        >কেন করবেন?
                        >কিভাবে করবেন?
                        >লোড কিভাবে আসবে?
                        কোন ধরনের গাছ লাগাবেন, মাটি ও গাছের জন্যে কেমন এক্সট্রা লোড আসবে, কিভাবে ডিজাইন লোড ধরতে হবে, কিভাবে বাগান করতে হবে এই সব নিয়ে থাকছে বিস্তারিত।।।
                        গ্রিন রুফ এর সাথে সিভিল ইঞ্জিনিয়ারিং, এনভায়রনমেন্টাল ইঞ্জিনিয়ারিং ও এগ্রিকালচার ৩ টাই ইম্পরট্যান্ট ভাবে জড়িত।
                        #ছাদ বাগান।।।।।
                        ছাদের উপরে বাগান করা নতুন কোন বিষয় নয়। তবে সবুজ ছাদ বা গ্রীন রুফ বলতে এই বাগান করার বিষয়টাকে দুই একটা টবের মধ্যে সীমাবদ্ধ না রেখে একটা বিশেষ পর্যায়ে নিয়ে যাওয়া বুঝানো হয়ে থাকে। উইকিপিডিয়া অনুসারে একটা ভবনের ছাদ পুরোপুরি বা বা কিছু অংশ পানি নিরোধী আবরণের উপরে বৃদ্ধি উপযোগী কোন মাধ্যমে জন্মানো গাছপালা দিয়ে আচ্ছাদিত থাকলে একে green roof বা সবুজ ছাদ বলা হয়....
                        #ভবনে সবুজ ছাদ
                        #লোড ও ডিজাইন
                        ছাদের উপরে মাটি তুলে তাতে চাষবাস বা বাগান করলে তা ভবনে অতিরিক্ত ভার দেবে। হ্যাঁ এই ওজনটা হেলাফেলা করে অবহেলা করার মত না। আমরা সিভিল ইঞ্জিনিয়ারিংএ পুরাতন নিয়মে বাসাবাড়ি বা ভবন নকশা করার সময়ে কাঠামোর নিজের ওজন ছাড়াও প্রতি বর্গফুটে ৪০ পাউন্ড নড়নচড়নশীল ওজন (লাইভ লোড) ধরে হিসাব কিতাব করি। এই ওজনটা হল আদমের ওজন + আদমদের ব্যবহৃত আসবাবপত্রের ওজনের জন্য। তবে স্কুল, কমিউনিটি হল, লাইব্রেরী, মসজিদ, বাসার সিড়ি এসবে এই লাইভ লোড ধরি ১০০ পাউন্ড/বর্গফুট (psf) --- বুঝতেই পারছেন এসব জায়গায় অনেক বেশি আদম জড়ো হবে + নড়াচড়া করবে - তাই অতিরিক্ত সতর্কতা। মাটির ওজন হল প্রতি ঘনফুটে ১১০ পাউন্ড -- এটা অবশ্য ভাল ভাবে দুরমুজ করে জমাট বাধানো (কম্প্যাক্ট করা) মাটির জন্য। গাছ লাগানোর মাটি হালকা ঝুরঝুরা থাকবে, পিটিয়ে শক্ত করা ঘন মাটি হবে না, তাই ছাদে ১ ফুট গভীরতার মাটি ফেললে অতিরিক্ত ওজন আসবে ১১০ পাউন্ড/বর্গফুটের চেয়ে কিছুটা কম। এর সাথে সেচের পানির ওজন, পানিরোধী আবরণ স্তরের ওজন, শিকড় বিকর্ষণকারী স্তর, এবং ড্রেনেজ স্তরের জন্য সামান্য অতিরিক্ত কিছুটা ওজন যুক্ত হতে পারে। কাজেই বেশি পরিমান মাটি ফেলে সারা ছাদকে বাগান বানাতে চাইলে ভবন নকশার সময়েই ছাদে অতিরিক্ত ওজন বহনের ব্যবস্থা রাখতে হবে। অবশ্য যদি ৩ ইঞ্চি মাটি দেই তাহলে প্রায় ২৮ পাউন্ড/বর্গফুট ওজন আসবে, যা আগের তৈরী ভবনের ছাদেও সমস্যা করবে না বলে আশা করা যায় (৩ ইঞ্চি মাটিতে মরিচ করল্লা ছাড়াও আরও অনেক রকম গাছ...
                        #প্রয়োজনীয় উপকরণঃ
                        * একটি খালি ছাদ;
                        * হাফ ড্রাম, সিমেন্ট বা মাটির টব, ষ্টিল বা প¬াস্টিক ট্রে;
                        * ছাদের সুবিধা মত স্থানে স্থায়ী বেড ( ছাদ ও বেডে মাঝে ফাঁকা রাখতে হবে।);যা
                        * সিকেচার, কোদাল, কাচি, ঝরনা, বালতি, করাত, খুরপি, স্প্রে মেশিন ইত্যাদি;
                        * দোঁআশ মাটি, পঁচা শুকনা গোবর ও কম্পোষ্ট, বালু ও ইটের খোয়া ইত্যাদি;
                        * গাছের চারা / কলম বা বীজ ।
                        #বাগান_পদ্ধতি
                        ছাদে বাগান দু'ভাগে করা যায়। যেমন কাঠ বা লোহার ফ্রেমে এঁটে বেড তৈরি করে এবং অন্যটি হলো টব, ড্রাম, পট কনটেইনার এসব ব্যবহার করে। প্রথম ক্ষেত্রে পুরো ছাদ বা ছাদের অংশবিশেষ ব্যবহারের ক্ষেত্রে কার্নিশের পার্শ্বে বা আলাদা ফ্রেম করে সুন্দরভাবে ডিজাইন করে সেটিং করা যায়। এ ক্ষেত্রে জল ছাদের প্রয়োজনীয়তা রয়েছে। জল ছাদ না থাকলে আলাকাতরার প্রলেপ দিয়ে তার ওপর মোটা পলিথিন বিছিয়ে তার ওপর মাটি দিতে হবে। মনে রাখতে হবে মাটির পুরুত্ব যত বেশি হবে। অন্তত দু'ফুট পুরু মাটির স্তর থাকতে হবে। তবে যত বেশি তত ভালো। অতিরিক্ত পানি, সার পাবার সুষ্ঠু পথ রাখতে হবে। পরবর্তীতে প্রয়েঅজনীয় পরিমাণ রাসায়নিক সার ব্যবহার করতে হবে। ফ্রেম তৈরির ক্ষেত্রে কাঠ, লোহা, স্টিল, মোটা রবার এসব ব্যবহার করা যায়। তবে যা কিছু দিয়ে বা যে ভাবেই বেড তৈরি হোক না কেন ৩/৪ বছর পর পুরো বেড ভেঙ্গে নতুন করে তৈরি করতে হবে। এতে রোগবালাই ও পোকামাকড়ের আক্রমণ থেকে পরিত্রাণ পাওয়া যায়। ছাদে বাগানের জন্য শুরুতেই যদি মাটিকে ফরমালডিহাইড দিয়ে (প্রতি লিটার পানির সাথে ১০০ মিলিলিটার ফরমালডিহাইড) শোধন করে নেয়া যায় মাটি শোধনের কৌশল হলে প্রয়োজন অনুযায়ী মাটি নিয়ে বর্ণিত মাত্রায় ফরমালডিহাইড মিশ্রিত পানি মাটিতে ছিটিয়ে দিয়ে পুরো মাটিকে মোটা পলিথিন দিয়ে ৩/৪ দিন ঢেকে রাখতে হবে। পরে পলিথিন উঠিয়ে সূর্যের আলোর তাপে খুলে রাখতে হবে পরবর্তী ৩/৪ দিন পর্যন্ত। ফরমালিনের গন্ধ শেষ হয়ে গেলেই মাটি ব্যবহারের উপযোগী হবে। দ্বিতীয় পদ্ধতির মধ্যে আছে ড্রাম, বালতি, টব, কনটেইনার এসবের যেকোন একটি বা দুটি নির্বাচন করার পর পাত্রের তলায় কিছু পরিমাণ খোয়া (ইট পাথরের কণা) দিতে হবে। ইটের খোয়া পানি নিষ্কাশন এবং অতিরিক্ত পানি বের করে দেয়া এবং পাত্রের ভেতরে বাতাস চলাচলের সহায়তা করে। এ ক্ষেত্রেও অর্ধেক মাটি এবং অর্দেক পঁচা জৈব সারের মিশ্রণ হতে হবে। মনে রাখতে হবে, শাক-সবজি, ফুলের জন্য ছোট খাট টব বা পাত্র হলেও চলে। কিন্তু ফলের ক্ষেত্রে পাত্র/ড্রাম যত বড় হয় তত ভালো। কেননা আমাদের বুঝতে হবে ফল গাছের শেকড় প্রকৃতিতভাবে বেশ গভীরে যায়। কিন্তু ড্রাম/টব/পাত্রের সীমিত জায়গার অভাবে যথাযথভাবে বিস্তৃতি লাভ করতে পারে না। সে জন্য ছাদের বাগানে টব/ড্রামের আকার যত বড় হয় তত ভালো হয়। টবে/ড্রামে গাছে/ জাত নির্বাচনের পর য়ৌক্তিকভাবে সাজাতে হবে। যেমন বড় গাছ পূর্ব ও দক্ষিন পাশে না দিয়ে পশ্চিম ও উত্তর পাশে দিতে হবে। এতে আলো বাতাস রোদ ভালোভাবে পাবে। তাছাড়া ছোট বড় জাতের মিশ্রণ করে সেটিং করলে গাছের গাত্র বৃদ্ধিসহ বাড় বাড়তি ভালো হয়। আরেকটি জরুরি কথা হলো ছাদে বাগাপন করার ক্সেত্রে ফল চাষাবাদে কলমের এবং হাইব্রিড জাতের ব্যবহার বেশি ফলদায়ক।
                        তৃতীয় আরেকটি পদ্ধতি অনেকেই অনুসরণ করে। সুন্দরভাবে বাঁশ/পিলার রড দিয়ে জাংলো বা মাচা বানিয়ে পব/প্লাস্টিকের পাত্রে ফুল, বাহারী গাছ গাছালী, অর্কিড আবাদ করে থাকেন। এক্ষেত্রে ঝুলন্ত টব/পাত্র মাঝখানে না ঝুলিয়ে পাশে ডিজাইন করে সেটিং করলে জায়গার সদ্ব্যবহার করা যায়, দেখতেও সুন্দর লাগে।
                        যেভাবে করবেন মাটি তো নেই, বিশেষ করে ঢাকাসহ দেশের বড় বড় শহরে যাঁরা বাস করেন, তাঁদের। কিন্তু গাছ তো দরকার। তাই শেষ ভরসা বাড়ির ছাদ। সেখানেই ফুল, সেখানেই ফল। পৃথিবীর অনেক দেশে এখন ছাদে বাগান করা সে দেশের সিটি করপোরেশনের বাধ্যতামূলক আইন। শহরের ইট-পাথর যেন সবুজের স্পর্শ পায়, আমাদের দেশে সেসবের বালাই নেই। ব্যক্তি উদ্যোগে দুই-একটা ছাদ বাগান হয়েছে। কিন্তু নির্মল পরিবেশের জন্য যা খুবই কম। ছাদে বাগান আর মাটিতে বাগান এক বিষয় নয়, আবার কাজটি যে কঠিন, তাও নয়। জানা দরকার, ছাদের উপযোগী গাছ কোনগুলো। গাছের প্রজাতির ওপর নির্ভর করে ওই গাছটি ছাদ-বাগানের জন্য তা হাফ ড্রাম, টব নাকি চৌবাচ্চা কাঠামো করে লাগানো হবে এবং এসব গাছের জন্য পরিচর্যার ধরন কী হবে, তা আগেই ঠিক করে নিতে হবে। খোলামেলা ছাদ থাকলেই হলো। স্থায়ী বাগান করার জন্য ছাদে সিমেন্টের স্থায়ী টব তৈরি করে নেওয়া যেতে পারে। গরুর নান্দার মতো বাজারে সিমেন্টের টব কিনতে পাওয়া যায়। সবচেয়ে উত্তম হয় লোহার হাফ ব্যারেল হলে। ব্যারেলের দুই পাশে হাতল থাকতে হবে। এর সুবিধা হচ্ছে টবটি এক স্থান থেকে আরেক স্থানে সরানো যাবে। টবের নিচে ছিদ্র থাকা জরুরি। কয়েকটি ভাঙা চাড়ি ছিদ্রের মুখে দিয়ে মাটি ভরতে হবে। তিন ভাগ মাটি, দুই ভাগ গোবর সার আর এক ভাগ পাতা পচা সার দিয়ে মিশ্রণ তৈরি করে টব পূর্ণ করুন। বর্ষার আগে আগে টবে চারা কলম লাগাতে হবে।
                        টবে ফুল, ফল, সবজির চাষ করা যেতে পারে। ফুলের মধ্যে গোলাপ, গাঁদা, দোলনচাঁপা, ডালিয়া, চন্দ্রমলি্লকা, ইউফোরবিয়াসহ মৌসুমি সব ফুলেরই চাষ করা সম্ভব। ছাদ বাগানে সবজিও ফলতে পারে। বেগুন, ফুলকপি, বাঁধাকপি, মরিচ, শসা, লাউ, কুমড়া, ঢেঁড়স, বরবটি, সিম, ক্যাপসিকাম, লেটুসপাতা, পুদিনাপাতা, ধনেপাতাসহ প্রায় সব ধরনের সবজি টবে ফলানো সম্ভব। ফলের মধ্যে আম, জাম, লিচু, শরিফা, সফেদা, কামরাঙ্গা, বাতাবিলেবু, জলপাই, কদবেল, ডালিম, পেয়ারা, কমলা, মালটা, কুল ছাদ বাগানকে আকর্ষণীয়, অনন্য করে তুলতে পারে। আজকাল অনেকেই ছাদ বাগান করার জন্য এগিয়ে আসছেন। তবে ছাদে ফল গাছ লাগানোর প্রবণতা বেশি লক্ষ করা যাচ্ছে। ছোট একটি টবে ফল ধরলে যেমন দেখতে সুন্দর লাগে, তেমনি ছাদে প্রচুর পরিমাণ রোদ লাগে বলে ফলও ভালো হয়।
                        ছাদ বাগান করুন পরিবেশ কে সুস্থ রাখুন।।। ।
                        
    
                    </Text>
                </Content>
            </Container>
        );
    }
}
