module.exports = [
    {
        title: "ছাদ বাগানের পরিচর্যা",
        content: "প্রতিদিন চাই যত্ন :  সকাল-বিকেল গাছে পানি দিতে হবে। গাছের গোড়ায় যাতে পানি না জমে সেদিকে খেয়াল রাখতে হবে। লম্বা গাছকে ছোট গাছের সামনে রাখতে হবে। টবে বা ফ্রেমে খৈল দেওয়া যাবে না, এতে পিঁপড়ার উপদ্রব বাড়তে পারে। বছরে একবার নতুন মাটি দিয়ে পুরনো মাটি বদলিয়ে দিতে হবে। ছাদে বাগানের জন্য মিশ্র সার, গুটি ইউরিয়া, খৈল, হাড়ের গুঁড়ো (পচিয়ে) ব্যবহার করা ভালো। সর্বোপরি ছাদের বাগানে যত্নের পাশাপাশি সচেতন দৃষ্টি রাখা চাই।            "
    },
    {
        title: 'ছাদ বাগানের খুঁটিনাটি',
        content: `
        বাড়ির বারান্দায় মালতি লতা, দোপাটি, হাসনাহেনা। উঠোনে লাউয়ের মাচা, ঘি কাঞ্চন মরিচ। একটু দূরেই ডালিম, প্রবীণ আম বৃক্ষ। এসব স্মৃতি হয়ে গেছে। স্মৃতি হয়ে গেছে দলিজ ঘরের বারান্দার বাগান, নিকানো উঠোন। কংক্রিটের দেয়াল, বহুতল ভবন ওইসব স্মৃতি গিলে খেয়েছে। নগর সভ্যতায় হারিয়ে যাচ্ছে মাটি। হারিয়ে যাচ্ছে সবুজ। তারপরও অনেকে বাগান করার স্বপ্ন দেখেন। জানালায় ঝুলিয়ে দেন মানিপ্লান্টের লতা। তবে স্বপ্ন থাকলে, ইচ্ছা থাকলে কংক্রিটের দালানকোঠার মধ্যেও বাগান করা সম্ভব। ফিরিয়ে আনা সম্ভব শৈশবের স্মৃতিঘেরা সেই হারানো লতা, ফুলের খশবু। ছাদে বাগান করে ফুল, ফল, সবজির সব স্বাদই পূরণ করা সম্ভব। এর জন্য প্রথম প্রয়োজন ইচ্ছাশক্তি আর বাগানের প্রতি প্রেম। কিভাবে বাগান করবেন খোলামেলা ছাদ থাকলেই হলো। স্থায়ী বাগান করার জন্য ছাদে সিমেন্টের স্থায়ী টব তৈরি করে নেওয়া যেতে পারে।
        গরুর নান্দার মতো বাজারে সিমেন্টের টব কিনতে পাওয়া যায়। সবচেয়ে উত্তম হয় লোহার হাফ ব্যারেল হলে। ব্যারেলের দুই পাশে হাতল থাকতে হবে। এর সুবিধা হচ্ছে টবটি এক স্থান থেকে আরেক স্থানে সরানো যাবে। টবের নিচে ছিদ্র থাকা জরুরি। কয়েকটি ভাঙা চাড়ি ছিদ্রের মুখে দিয়ে মাটি ভরতে হবে। তিন ভাগ মাটি, দুই ভাগ গোবর সার আর এক ভাগ পাতা পচা সার দিয়ে মিশ্রণ তৈরি করে টব পূর্ণ করুন। বর্ষার আগে আগে টবে চারা কলম লাগাতে হবে। এই টবে ফুল, ফল, সবজির চাষ করা যেতে পারে। ফুলের মধ্যে গোলাপ, গাঁদা, দোলনচাঁপা, ডালিয়া, চন্দ্রমলি্লকা, ইউফোরবিয়াসহ মৌসুমি সব ফুলেরই চাষ করা সম্ভব।
        ছাদ বাগানে সবজিও ফলতে পারে। বেগুন, ফুলকপি, বাঁধাকপি, মরিচ, শসা, লাউ, কুমড়া, ঢেঁড়স, বরবটি, সিম, ক্যাপসিকাম, লেটুসপাতা, পুদিনাপাতা, ধনেপাতাসহ প্রায় সব ধরনের সবজি টবে ফলানো সম্ভব। ফলের মধ্যে আম, জাম, লিচু, শরিফা, সফেদা, কামরাঙ্গা, বাতাবিলেবু, জলপাই, কদবেল, ডালিম, পেয়ারা, কমলা, মালটা, কুল ছাদ বাগানকে আকর্ষণীয়, অনন্য করে তুলতে পারে। আজকাল অনেকেই ছাদ বাগান করার জন্য এগিয়ে আসছেন। তবে ছাদে ফল গাছ লাগানোর প্রবণতা বেশি লক্ষ করা যাচ্ছে। ছোট একটি টবে ফল ধরলে যেমন দেখতে সুন্দর লাগে, তেমনি ছাদে প্রচুর পরিমাণ রোদ লাগে বলে ফলও ভালো হয়। কি কি গাছ লাগাবেন ছাদ বাগানের প্রথম শর্ত হচ্ছে, গাছ বাছাই। জেনে, বুঝে, বিশ্বস্ত নার্সারি, বন্ধুবান্ধবের কাছ থেকে গাছ সংগ্রহ করতে হবে। বেঁটে প্রজাতির অতিদ্রুত বর্ধনশীল ও ফল প্রদানকারী গাছই ছাদ বাগানের জন্য উত্তম। বীজের চারা নয়, কলমের চারা লাগালে অতিদ্রুত ফল পাওয়া যায়। আজকাল বিভিন্ন ফলের গুটি কলম, চোখ কলম ও জোড় কলম পাওয়া যাচ্ছে।
        ছাদ বাগানের জন্য এসব কলমের চারা সংগ্রহ করতে পারলে ভালো হয়। টবে আমের মধ্যে আম্রপালি, আলফানসো, বেঁটে প্রজাতির বারোমেসে, লতা, ফিলিপাইনের সুপার সুইট, রাঙ্গু আই চাষ করা যেতে পারে। লেবুর মধ্যে কাগজিলেবু, কমলা, মালটা, নারকেলি লেবু, কামকোয়াট, ইরানিলেবু, বাতাবিলেবু (অ্যাসেম্বল) টবে খুবই ভালো হয়। এ ছাড়া কলমের জলপাই, থাইল্যান্ডের মিষ্টি জলপাই, কলমের শরিফা, কলমের কদবেল, ডালিম, স্ট্রবেরি, বাউকুল, আপেলকুল, নারিকেলকুল, লিচু, থাইল্যান্ডের লাল জামরুল, গ্রিন ড্রপ জামরুল, আপেল জামরুল, আঙ্গুর পেয়ারা, থাই পেয়ারা, ফলসা, খুদে জাম, আঁশফল, জোড় কলমের কামরাঙা, এমনকি ক্যারালা ড্রফ প্রজাতির নারিকেলের চাষ করা যেতে পারে। সঠিক মানের চারা হলে এক বছরের মধ্যেই ফল আসে। আজকাল বিদেশ থেকে উন্নত মানের কিছু চারা কলম দেশে আসছে।
        ছাদ বাগানের সাধ পূরণ করার জন্য এসব সংগ্রহ করে লাগাতে পারেন। বাহারি পাতার জামরুল, পেয়ারা, সফেদা গাছও বিভিন্ন নার্সারিতে এখন কিনতে পাওয়া যাচ্ছে। ছাদে এসব গাছ লাগানো হলে ছাদ বাগানের সৌন্দার্য বৃদ্ধি পায়। যত্ন বর্ষা মৌসুমে চারা লাগানোর পর চারাটি একটি শক্ত কাঠির অবলম্বন দিয়ে বেঁধে দিতে হবে। টবে মাটি থাকে কম, এ জন্য ছাদ বাগানের বিশেষ যত্নের প্রয়োজন। নিয়মিত ঝাঁজরির সাহায্যে পানির সেচ দিতে হবে। আবার গ্রীষ্ম মৌসুমে প্রচণ্ড খরার হাত থেকে রক্ষার জন্য গাছের গোড়ায় বিচলি ছোট ছোট করে কেটে বিছিয়ে দিতে হবে। সব সময়ই গাছের গোড়া পরিষ্কার রাখা প্রয়োজন। এতে গাছ দ্রুত বাড়ে। আবার পোকামাকড়ের উপদ্রব কম হয়। মনে রাখা প্রয়োজন, টবের গাছকে লম্বা হতে না দিয়ে ঝোপালো রাখলে ফল বেশি পাওয়া যায়। দেখতেও সুন্দর লাগে।
        এ কারণে নিয়মিত ডাল ছাঁটাই করা প্রয়োজন। মরা ডালগুলো কেটে দিতে হবে। মাঝেমধ্যে চাপানো সার হিসেবে খৈল গুঁড়ো করে কিংবা ভিজিয়ে দেওয়া যেতে পারে। রাসায়নিক সার না দেওয়াই ভালো। গাছের মন-মর্জি বুঝে নির্দিষ্ট পরিমাণে রাসায়নিক সার দেওয়া যেতে পারে। পাতার সার হিসেবেও হরমন প্রয়োগ করা যেতে পারে। টবের মাটিতে কেঁচো হলে ডাক্তারি পটাশ গুলিয়ে মাটিতে দেওয়া হলে কেঁচো মরে যাবে। বিষ, কীটনাশক না দেওয়াই ভালো। পোকার আক্রমণ দেখা দিলে ছাই, গুল গুলিয়ে, নিমপাতা গুলিয়ে দেওয়া যেতে পারে। তবে সবচেয়ে উত্তম তামাকপাতা আর সাবান গুলিয়ে পানিতে ফুটিয়ে প্রয়োগ করা। এতে ভালো ফল পাওয়া যায়। এর পরও পোকার উপদ্রব বৃদ্ধি পেলে কম মাত্রার কীটনাশক স্প্রে করা যেতে পারে। ফুল আসার আগে সার না দেওয়াই ভালো। ফলের আকার মসুরি দানার মতো হলে নির্দিষ্ট মাত্রায় হরমন প্রয়োগ করা যায়। এতে ফলঝরা বন্ধ হয়। দ্রুত ফল বাড়ে। তিন বছর পরপর ফল গাছের শিকড় ছাঁটাই করা প্রয়োজন। বর্ষা মৌসুমের আগে আগে মাটিসহ ফল গাছটি টব থেকে বের করে আনতে হবে। ধারালো অস্ত্র দিয়ে শিকড় ছাঁটাই করে ফের নতুন সার মাটি দিয়ে গাছটিকে লাগিয়ে দিতে হবে। এ ক্ষেত্রে নিয়মিত পানি সেচ দেওয়া প্রয়োজন। স্বপ্ন, ইচ্ছাশক্তি, টব, মাটি, ঝাঁঝরি, নিড়ানি, সিকেটিয়ার, হ্যান্ড স্প্রে এগুলোকে পুঁজি করে আপনিও ঝাঁপিয়ে পড়ুন ছাদ বাগানে। অবশ্যই সফল হবেন। যখন ফুল, ফলে আপনার বাগান ভরে উঠবে, তখন আপনিও উৎফুল্ল হবেন। নিজের বাগানের ফল পরিবারের সবাইকে নিয়ে খাওয়া, বন্ধুবান্ধব, আত্মীয়স্বজনকে উপহার দেওয়া এর চেয়ে আনন্দের আর কি আছে?        
        `,
    },
    {
        title: 'ছাদে যেসব গাছ লাগাবেন',
        content: `
        ছাদে বাগান আর মাটিতে বাগান এক বিষয় নয়, কাজটি যে কঠিন, তাও নয়। জানা দরকার, ছাদের উপযোগী গাছ কোনগুলো। গাছের প্রজাতির ওপর নির্ভর করে গাছটি ছাদবাগানের জন্য হাফ ড্রাম, টব নাকি চৌবাচ্চা কাঠামো করে লাগানো হবে । খোলামেলা ছাদ থাকলে ভালো। স্থায়ী বাগান করার জন্য ছাদে সিমেন্টের টব তৈরি করে নেওয়া যেতে পারে। সিমেন্টের টব কিনতে পাওয়া যায়। সবচেয়ে ভালো লোহার হাফ ব্যারেল হলে। ব্যারেলের দুই পাশে হাতল থাকলে এক স্থান থেকে আরেক স্থানে সরানো যাবে। টবের নিচে ছিদ্র থাকা জরুরি। তিন ভাগ মাটি, দুই ভাগ গোবর সার আর এক ভাগ পাতা পচা সার দিয়ে মিশ্রণ করে টব পূর্ণ করুন। টবে ফুল, ফল, সবজির চাষ করা যেতে পারে। 
        ছাদে যেসব গাছ লাগাবেন : ছাদে বাগান করার সময় লক্ষ রাখতে হবে গাছটি বড় আকারের না হয়। ছোট আকারের গাছ লাগাতে হবে এবং ছোট আকারের গাছে যেন বেশি ফল ধরে সে জন্য হাইব্রিড জাতের ফলজ গাছ লাগানো ভালো। জেনে, বুঝে, বিশ্বস্ত নার্সারি থেকে গাছ সংগ্রহ করতে হবে। বেঁটে প্রজাতির অতিদ্রুত বর্ধনশীল ও ফল প্রদানকারী গাছই ছাদবাগানের জন্য ভালো। বীজের চারা নয়, কলমের চারা লাগালে অতিদ্রুত ফল পাওয়া যায়। নার্সারিতে বিভিন্ন ফলের গুটিকলম, চোখ কলম ও জোড় কলম পাওয়া যাচ্ছে। এগুলো সংগ্রহ করতে পারলে ভালো হয়। সঠিক মানের চারা হলে এক বছরের মধ্যেই ফল আসে। বিদেশ থেকে উন্নত মানের কিছু চারা কলম দেশে আসছে। ছাদবাগানের সাধ পূরণ করার জন্য এসব সংগ্রহ করে লাগাতে পারেন।
                 
        `,
    },
    {
        title: 'পদ্ধতি',
        content: `
        
        ছাদে বাগান করার পদ্ধতিঃ
        টব পদ্ধতি : খুব সহজে এক স্থান থেকে অন্য স্থানে স্থানান্তর করা যায় বলে এটাই সহজ পদ্ধতি বলে বিবেচিত। তবে ফলের গাছের জন্যে টব সাধারণত যে আকারের হয়ে থাকে তাতে খুব একটা ভালো হবে না। বড় আকারের টবে ফলের গাছ লাগানো যেতে পারে। সেই ক্ষেত্রে সিমেন্টের তৈরি বড় টব ব্যবহার করা যায়। টবে চাষ করার জন্য পর্যাপ্ত পরিমাণ জৈব সার ব্যবহার করা উচিত। ১৪ ইঞ্চি থেকে ১৮ ইঞ্চি আকারের একটি টবের জন্য জৈব সারের পাশাপাশি ১০০ গ্রাম টিএসপি এবং ৫০ গ্রাম এমওপি সার উত্তমরূপে মিশিয়ে ১০ – ১২ দিন রেখে দিতে হবে। তারপর টব ভরাট করতে হবে।
        হাফড্রাম পদ্ধতি : বর্তমানে বেশিরভাগ মানুষই হাফড্রাম পদ্ধতিতে ছাদে ফলের বাগান করে থাকেন। হাফড্রামের তলদেশে ছিদ্র করতে হবে। ছিদ্রগুলোয় ইটের টুকরো বসাতে হবে; তার উপরে ড্রামের তলদেশে প্রথম ১ ইঞ্চি পরিমাণ খোয়া বা সুড়কি দিতে হবে এবং তার উপরে এক ইঞ্চি পরিমাণ জৈব সার বা পচা গোবর দিতে হবে। এর ফলে অতিরিক্ত পানি সহজেই বের হয়ে যেতে পারবে। জৈব সারের পাশাপাশি প্রতিটি ড্রামে ২০০ গ্রাম টিএসপি, ১০০ গ্রাম এমওপি ব্যবহার করা যেতে পারে।  আম ও লেবু জাতীয় গাছের জন্য প্রতিটি ড্রামে উপরিউক্ত জৈব ও রাসায়নিক সারের পাশাপাশি ৫০০ গ্রাম হাড়ের গুড়া ব্যবহার করা যেতে পারে। শাক-সবজি, ফুলের জন্য ছোট খাট টব বা পাত্র হলেও চলে। কিন্তু ফলের ক্ষেত্রে পাত্র/ড্রাম যত বড় হয় তত ভালো।
        স্থায়ী বেড পদ্ধতি : ছাদে বাগান করার জন্য স্থায়ী বেড পদ্ধতি একটি আধুনিক পদ্ধতি। স্থায়ী বেড পদ্ধতিতে ছাদে বাগান করার পূর্বে ছাদ বিশেষভাবে ঢালাই দিয়ে নেট ফিনিশিং করে নিতে হবে। এর ২ টি পদ্ধতি আছে। যথাঃ
        ছাদের চারদিকে স্থায়ী বেড পদ্ধতিঃ  এ পদ্ধতিতে বাগান করার জন্য ছাদের চারিদিকে ২ ফুট প্রস্থের দুই পাশে ১.৫ ফুট উঁচু দেয়াল ৩ ইঞ্চি গাঁথুনির নেট ফিনিশিং ঢালাই দিয়ে তৈরি করলে মাঝখানে যে খালি জায়গা তৈরি হয়, সেই খালি জায়গার তলায় প্রথমে এক ইঞ্চি ইটের সুড়কি বা খোয়া, পরের এক ইঞ্চি গোবর সার দেয়ার পর বাকি অংশ ২ ভাগ মাটি ও ১ ভাগ গোবরের মিশ্রণ দিয়ে ভরাট করে স্থায়ী বেড তৈরি করা হয়। অতিরিক্ত পানি, সার পাবার সুষ্ঠু পথ রাখতে হবে।
        ট্যাংক পদ্ধতিঃ ছাদে ট্যাংক পদ্ধতিতেও গাছ লাগানো যায়। সেজন্য ছাদে এক ফুট উঁচু ৪টি পিলারের উপর পানির ট্যাংক আকৃতির ৩ ফুট দৈর্ঘ্য, ২ ফুট প্রস্থ ও ১.৫ ফুট উঁচু ৩ ইঞ্চি গাঁথুনির নেট ফিনিশিং ঢালাই দিয়ে যে ট্যাংক তৈরি করা হয়। একেই বলে ট্যাংক বেড পদ্ধতি।
        গাছ লাগানোর নিয়মঃ খুব সাবধানতার সাথে টব/পটে/ড্রামে/স্থায়ীবেডে চারা/কলম লাগাতে হবে। ঠিক মাঝখানে পরিমাণ মতো মাটির নিচে রোপন করতে হবে। চারা বা কলমের সাথে লাগানো মাটির বল যেন না ভাঙ্গে সেদিকে নজর রাখতে হবে। চারা বা কলমের ক্ষেত্রে বীজতলা বা নার্সারিতে যতটুকু নিচে বা মাটির সমানে ছিল ততটুকু সমানে ছাদে লাগাতে হবে। বীজতলার থেকে কম বা বেশি গভীরে লাগালে গাছের বাড়বাড়তিতে সমস্যা হতে পারে।
        টবের সাইজঃ  নতুন বাগান শুরু করার ক্ষেত্রে ইচ্ছা করলে ১২ ইঞ্চি মাটির টব দিয়েই শুরু করা যায় । তবে সব গাছ ১২ ইঞ্চি টবে লাগানো ঠিক হবে না । ১২ ইঞ্চি টবের উপযোগী চারা যেমন – লেবু , ডালিম , কামরাংগা , করমচা , সফেদা , মিশরীয় ডুমুর , চেরী ফল , কমলা, বারমাসী আমড়া ইত্যাদি । ১৬-২০ ইঞ্চি টবের উপযোগী গাছ – থাই মিষ্টি তেতুল , পেয়ারা , জামরুল , আংগুর , বাতাবী লেবু , আম , আতা , অরবরই , আমলকি , মালটা ইত্যাদি । ২০ ইঞ্চি টবের চেয়ে বড় মাটির টব না থাকায় এর চেয়ে বড় সিমেন্টের টব বা হাফ ড্রামের উপযোগী গাছ – যে কোন কূল , জলপাই , কতবেল , বেল , বারমাসী কাঁঠাল , জাম , পেঁপেঁ , কলা ইত্যাদি । উল্লেখ্য যে , উক্ত গাছ গুলি এর চেয়ে ছোট টবে করাও সম্ভব । তবে ভালো ফলাফলের জন্য বড় টব আবশ্যক।
        সেচ ব্যবস্থাপনাঃ সেচ বা নিষ্কাশন ছাদ বাগানের একটি গুরুত্বপূর্ণ বিষয়। কেননা মাটির আর্দ্রতা কমে গেলে যেমন সহজেই গাছপালা নেতিয়ে যাবে তেমনি অতিরিক্ত পানি বা আর্দ্রতার জন্যও গাছ নেতিয়ে পড়ে মরে যেতে পারে। এ জন্য গাছের গোড়া শুকালেই কেবল পানি দেয়া যাবে, গোড়া ভেজা থাকলে কোনো মতেই তাতে পানি দেওয়া যাবে না। কিছু গাছ বেশি পানি গ্রহণ করে (ড্রাগন, নারিকেল) অনেক গাছে পানি কম লাগে (শিম, মরিচ, বেগুন)। তাই ছাদ বাগানে প্রতিনিয়ত অবশ্যই সেচের ব্যাপারে সচেতন থাকতে হবে।গাছের গোড়ায় যাতে পানি জমে না থাকে সেদিকে লক্ষ রাখতে হবে। ছাদ বাগানে প্লাস্টিকের চিকন পাইপ বা ঝাঁঝরি দিয়ে সেচ দেওয়ায় উত্তম। সেচ অবশ্যই সকাল বেলা দিতে হবে।
        ছাদ বাগানের পরিচর্যাঃ
        গাছের ডাল-পালা ছাঁটাইঃ ছাদ বাগান সব সময় পরিষ্কার পরিচ্ছন্ন রাখতে হবে। সেজন্য পুরাতন রোগাক্রান্ত, বয়স্ক ডালপালা, পাতা সাবধানতার সাথে কেটে নির্দিষ্ট স্থানে জমা করতে হবে। এতে গাছপালা রোগমুক্ত থাকবে এবং গাছের বৃদ্ধি ও ফলন ভালো হবে। কুল গাছের ক্ষেত্রে কুল খাওয়ার পর ফাল্গুন মাসের মাঝামাঝি গাছের সমস্ত ডাল কেঁটে দিতে হবে। তাছাড়াও মরা ও রোগাক্রান্ত ডাল গুলো কেটে বোর্দ পেষ্ট লাগাতে হবে।
        গাছে খুঁটি ও টবের মাটি আলগা ও মালচিং : উন্নত কাঙিক্ষত জাতের কলম করা গাছ রোপণ করে গাছে কাঠি বা খুঁটি দিয়ে সোজা করে রাখতে হবে। তাতে গাছের হেলে পড়া বা নড়ে গিয়ে দুর্বল হওয়া রোধ হবে।১৫-২০ দিন পর পর নিড়ানি দিয়ে ওপরের স্তর ভেঙে দিতে হবে। ফলে আগাছা দমন করা যাবে ও ভেতরে বায়ু চলাচলে সুবিধা হবে। খরা মৌসুমে দীর্ঘমেয়াদি বড় গাছের গোড়ার চার ধারে শুকনা কচুরিপানা বা খড়কুটা, শুকনো পাতা দিয়ে মালচিং দেওয়া হলে রস সংরক্ষিত থাকবে, ঘাস গজানো রোধ হবে এবং পরে এগুলো পচে সার হিসেবে কাজে লাগবে।
        টব বা ড্রামের মাটি পরিবর্তনঃ  এ বিষয়টিও ছাদ বাগানের ক্ষেত্রে একটি গুরুত্বপূর্ণ অংশ সাধারণত বর্ষার শেষে কাজটি করতে পারলে ভাল । পূর্বেই কিছু বেলে দো-আঁশ অথবা দো-আঁশ মাটির দুই ভাগের সাথে একভাগ গোবর মিশাতে হবে । যে কয়টি টবের মাটি পরিবর্তন করতে হবে প্রতিটি টবের জন্য আনুমানিক ৪০ গ্রাম টিএসপি, ৪০ গ্রাম পটাশ , ১০০ গ্রাম হাড়ের গুঁড়া ১০ গ্রাম হারে সরিষার খৈল একত্রে মাটির সঙ্গে মিশিয়ে পানি দিয়ে ১০-১২ দিন রেখে দিতে হবে। অতঃপর যে টবের মাটি পরিবর্তন করতে হবে সেই গাছের টবের গাঁ ঘেঁষে ২ ইঞ্চি প্রস্থে এবং ৬-৮ ইঞ্চি গভীর করে মাটি ফেলে দিতে হবে । এটি ১৬-২০ ইঞ্চি টবের ক্ষেত্রে প্রযোজ্য। পুরাতন মাটি সরানোর পর ঐ স্থানটি পূর্বেই প্রস্তুতকৃত মাটি দিয়ে ভরে দিতে হবে ।
        গাছের সঠিক অবস্থান: কোন কোন গাছ বেশি রোদ পছন্দ করে (কাগজি লেবু, ড্রাগন ফল) কোন গাছ আধা ছায়ায় ভালো হয় (এলাচি লেবু, জামরুল), আবার কোনো গাছ ছায়া পছন্দ করে (লটকন, রামবুটান)। এজন্য ছাদ বাগান থেকে বেশি সুফল পেতে ছাদে রোদের/আলো-বাতাস প্রাপ্তি অবস্থা বুঝে গাছের অবস্থান চূড়ান্ত করা প্রয়োজন।
        সার প্রয়োগঃ ফল গাছে বছরে অন্তত ২ বার সার দিতে হবে, যেমন- বর্ষার আগে ও বর্ষার পরে। মাছ, মাংস ও তরকারি ধোয়া পানি গাছে ব্যবহার করলে গাছের খাবারের অভাব কিছুটা পূরণ হয়। এছাড়াও মিশ্র সার, হাড়ের গুড়া এবং অনুখাদ্য (দস্তা, বোরন, ম্যাগনেসিয়াম, ম্যাঙ্গানিজ) বছরে একবার প্রয়োগ করা ভালো। মাছের কাঁটা, হাড়ের টুকরা, ডিমের খোসা, তরিতরকারির পরিত্যক্ত অংশ, পাতা, একটা ড্রামে পঁচিয়ে নিয়ে ছাদ বাগানে ব্যবহার করা ভালো। এছাড়াও ট্রাইকোডারমা, কেঁচো সার, কুইক কম্পোস্ট, ও বাজারে প্রাপ্ত অন্যান্য জৈব সার ছাদ বাগানে ব্যবহার করাই উত্তম। অপেক্ষাকৃত ছোট টব থেকে বড় টবে গাছ অপসারণ করার মাধ্যমে গাছকে স্বাস্থ্যবান করা যায়। ফুল-ফল ঝরা রোধে ও ফল ধরা বাড়াতে নানা প্রকার অনুখাদ্য/হরমোন (সিলভামিক্স, লিটোসেন, ফ্লোরা প্রয়োগ করা যেতে পারে।
        `,
    },
    {
        title: 'ছাদে ফলের বাগান পদ্ধতি',
        content: `
        কি গাছ লাগাবেন তার উপর নির্ভর করবে কোথায় কিভাবে সেই গাছ লাগাবেন। মনে রাখতে হবে যে গাছ লাগাবেন সেই গাছের আকার যত বড় হবে গাছ লাগানোর পাত্র/ড্রাম/টবের আকার ও তত বড় হতে হবে। দেখে নেই পদ্ধতই গুলোঃ
        টব পদ্ধতি : খুব সহজে এক স্থান থেকে অন্য স্থানে স্থানান্তর করা যায় বলে এটাই সহজ পদ্ধতি বলে বিবেচিত। তবে ফলের গাছের জন্যে টব সাধারণত যে আকারের হয়ে থাকে তাতে খুব একটা ভালো হবে না। বড় আকারের টবে ফলের গাছ লাগানো যেতে পারে। সেই ক্ষেত্রে সিমেন্টের তৈরি বড় টব ব্যবহার করা যায়। টবে চাষ করার জন্য পর্যাপ্ত পরিমাণ জৈব সার ব্যবহার করা উচিত। ১৬ ইঞ্চি থেকে ১৮ ইঞ্চি আকারের একটি টবের জন্য জৈব সারের পাশাপাশি ১০০ গ্রাম টিএসপি এবং ৫০ গ্রাম এমওপি সার উত্তমরূপে মিশিয়ে ১০ দিন থেকে ১২ দিন রেখে দিতে হবে। তারপর টব ভরাট করতে হবে।
        হাফড্রাম পদ্ধতি : বর্তমানে বেশিরভাগ মানুষই হাফড্রাম পদ্ধতিতে ছাদে ফলের বাগান করে থাকেন। হাফড্রামের তলদেশে ছিদ্র করতে হবে। ছিদ্রগুলোয় ইটের টুকরো বসাতে হবে; তার উপরে ড্রামের তলদেশে প্রথম ১ ইঞ্চি পরিমাণ খোয়া বা সুড়কি দিতে হবে এবং তার উপরে এক ইঞ্চি পরিমাণ জৈব সার বা পচা গোবর দিতে হবে। এর ফলে অতিরিক্ত পানি সহজেই বের হয়ে যেতে পারবে। জৈব সারের পাশাপাশি প্রতিটি ড্রামে ২০০ গ্রাম টিএসপি, ১০০ গ্রাম এমওপি ব্যবহার করা যেতে পারে। মনে রাখতে হবে, শাক-সবজি, ফুলের জন্য ছোট খাট টব বা পাত্র হলেও চলে। কিন্তু ফলের ক্ষেত্রে পাত্র/ড্রাম যত বড় হয় তত ভালো।
        স্থায়ী বেড পদ্ধতি : স্থায়ী বেড পদ্ধতি একটি আধুনিক পদ্ধতি। ছাদে বাগান করার পূর্বে ছাদ বিশেষভাবে ঢালাই দিয়ে নেট ফিনিশ করে নিতে হবে। স্থায়ী বেড পদ্ধতির বাগান করার জন্য ছাদের চারিদিকে ২ ফুট প্রস্থের দুই পাশে ১.৫ ফুট উঁচু দেয়াল ৩ ইঞ্চি গাঁথুনির নেট ফিনিশিং ঢালাই দিয়ে তৈরি করলে মাঝখানে যে খালি জায়গা তৈরি হয়, সেই খালি জায়গার তলায় প্রথমে এক ইঞ্চি ইটের সুড়কি বা খোয়া, পরের এক ইঞ্চি গোবর সার দেয়ার পর বাকি অংশ ২ ভাগ মাটি ও ১ ভাগ গোবরের মিশ্রণ দিয়ে ভরাট করে স্থায়ী বেড তৈরি করা হয়। অতিরিক্ত পানি, সার পাবার সুষ্ঠু পথ রাখতে হবে।

        `,
    },
    {
        title: 'ঘরেই তৈরি করুন পটিং মিক্স',
        content: `
        প্রতিটি গাছেরই ঠিকমতো সুস্থ ও স্বাভবিকভাবে বেড়ে উঠার জন্য মাটি প্রয়োজন। গাছের মূল মাটির নিচে থাকে। এই মূলের মাধ্যমেই গাছ ঠিকভাবে গড়ে ওঠে। তাই গাছের বেড়ে উঠা সম্পূর্ণ নির্ভর করে মাটির উপর। আমরা যারা শহরে বাস করি এবং ছাদ বাগান করতে চাই তাদের ক্ষেত্রে চাই হালকা ওজন, পুষ্টিগুণ সম্পন্ন ও পানি নিষ্কাশনের সুব্যবস্থা সম্পন্ন মাটি। শুধু বাইরে থেকে মাটি এনে তাতে গাছ লাগালাম আর গাছ বেড়ে উঠবে তা কিন্তু সঠিক নয়।
        .
        গাছের পুষ্টি সরবরাহ করতে পারে এবং বিভিন্ন রোগ যাতে না হয় আর আগাছামুক্ত গাছের বৃদ্ধির জন্য পটিং মিক্স একটি মিডিয়া। এই পটিং মিক্স কি, কেন প্রয়োজন, কিভাবে ঘরেই তৈরি করা যায় তা নিয়ে আলোচনা করা যাক।
        .
        পটিং মিক্স ছাদ বাগান বা ঘরের আঙিনায় টবে লাগানো  গাছের জন্য খুবই গুরুত্বপূর্ণ ক্রমবর্ধমান মিডিয়াম। কর্ণেল ইউনিভার্সিটিতে ১৯৬০ সালে জেমস কুডলি ও তার টিম কর্ণেল মিক্স নামে একটা মিক্স উদ্ভাবন করেন যা পটিং মিক্স হিসেবে খুবই জনপ্রিয়। বিভিন্ন দেশে পটিং মিক্সের উপাদান স্থানীয় উৎস অনুযায়ী বিভিন্ন রকম হতে পারে। যেমনঃ আমেরিকাতে প্রধানত পিট মস, কম্পোস্ট, পারলাইট, ভার্মিকুলাইট ইত্যাদি মিক্স করে পটিং মিক্স তৈরি করা হয়। আমাদের দেশে পিট মসের বদলে কোকোপিট বা কোকোডাস্ট এবং পারলাইট- ভার্মিকুলাইটের বদলে ঝামা ইটের টুকরা ব্যবহার করে পটিং মিক্স তৈরি করা যায়। এ ধরনের তৈরিকৃত মাটি যেমন গাছের বৃদ্ধি নিশ্চিত করে তেমনি পানি নিষ্কাশন ভাল হওয়ায় পানি জমে গাছের মারা যাওয়ার ভয় থাকে না।
        
        পটিং মিক্স কেন প্রয়োজন
        .
        খরচ বাঁচানো
        .
        মাটিসহ সার প্রয়োগ করা খুব বেশি খরচের হয়ে থাকে। কিন্তু বাসায় এই প্রক্রিয়া অবলম্বন করলে খরচ তুলনামূলক কম হয়।
        .
        সময় বাঁচানো
        .
        কম সময়ে গাছের চারা বৃদ্ধি পায়।
        .
        নিরাপদ উপাদান
        .
        এই প্রক্রিয়াটিতে কোনো প্রকার অজৈব উপাদান থাকে যা গাছের জন্য সম্পূর্ণ নিরাপদ।
        .
        ওজনে হালকা
        .
        আমরা যারা শহর অঞ্চলে বাগান করি ছাদ বাগান কিংবা বাড়ির আঙিনায় বা বারান্দায় তাদের জন্য গাছের পরিচর্যায় অবশ্যই টবটি হালকা হওয়া জরুরি। পটিং মিক্স ওজনে হালকা হওয়ার কারণে টবের ওজন কম হয় তাতে করে গাছের টব এক জায়গা হতে অন্য জায়গায় নেয়া যায় খুব সহজে।
        .
        পরিবেশ বান্ধব
        .
        পটিং মিক্স এ সম্পূর্ণ জৈব উপাদানে তৈরি যা পরিবেশের জন্য নিঃসন্দেহে পরিবেশবান্ধব।
        .
        দীর্ঘস্থায়ী
        .
        পটিং মিক্স দীর্ঘ দিন পর্যন্ত গাছের পুষ্টি সরবরাহ করে।ফলে মাটি পরিবর্তন করার প্রয়োজন হয় না।
        .
        রোগমুক্ত রাখা
        .
        বীজ সহজে অঙ্কুরিত হতে সাহায্য করে। বিভিন্ন পানিবাহিত রোগ( যেমনঃ গোড়া পঁচা, শিকড় পঁচা ইত্যাদি), মাটিবাহিত রোগ( যেমনঃ চারা ঢলে পড়া, চারা পঁচে যাওয়া ইত্যাদি) থেকে রক্ষা করে।
        পটিং মিক্স তৈরিতে প্রয়োজনীয়  উপকরণ
        .
        একটি পরিমাপের পাত্র
        একটি প্লাস্টিকের বা ফোমের পাত্র কোকোপিট আগে থেকে ভিজিয়ে নেয়ার জন্য
        একটি বড় পাত্র অথবা বালতি যাতে সকল উপাদান মিশানো যায় এমন
        সিভ বা ছাকনি
        একটি ছোট ফোর্ক বা কর্নিক( trowel) 
        পটিং মিক্সের উপাদান
        .
        (১) কোকোপিট বা কোকোডাষ্ট
        .
        মাটির সাবস্টিটিউট হিসেবে এটা ব্যবহার করা হয়। কখনও কখনও কোকোপিটের বদলে পিট মসও ব্যবহৃত হয়ে থাকে।
        .
        কোকোপিট মূলত নারকেলের ছোবড়া থেকে তৈরি হয়। ৫ কেজি/৫০০ গ্রাম এমন বড় বড় হালকা ওজনের কোকোপিটের ব্লক হিসেবে পাওয়া যায় যা দেখতে চারকোণা ইটের মতো।
        কেন কোকোপিটের প্র‍য়োজন?
        .
        এটি হালকা হওয়ার কারণে টবের ওজন কম হয় তাই ছাদে অতিরিক্ত চাপ পরে না। টব সহজেই এক জায়গা থেকে আরেক জায়গায় স্থানান্তর করা যায়।
        মাটির থেকে বেশি পানি ধারণ ক্ষমতা এবং নিষ্কাষণ ক্ষমতাও মাটি থেকে বেশি।
        অনেক সময় টবের মাটিতে দলা সৃষ্টি করলে সেটির হাত থেকেও রক্ষা করে।
        পানি সমভাবে চারিদিকে ছড়িয়ে দেয় এমনকি পানির পরিমাণ কম হলেও গাছের পানির অভাব হয় না।
        আগাছামুক্ত থাকে।
        সাধারণ মাটির তুলনায় কোকোপিটে  গাছের শিকড়ের সংখ্যা বৃদ্ধি পায়। তাই গাছ তাড়াতাড়ি বৃদ্ধি পায়।
        উপকারী ব্যাক্টেরিয়ার সংখ্যা বৃদ্ধি পায়।
        মাটির তাপমাত্রা ঠিক রাখে।
        অধিকবার ব্যবহারযোগ্য।
        এতে পটাশিয়াম, ম্যাগনেসিয়াম, আয়রন রয়েছে।
        পিএইচ ৫.৫-৬.৫ যা গাছের বৃদ্ধির জন্য উপযুক্ত।
        .
        (২)ভার্মিকম্পোষ্ট
        .
        ভার্মিকম্পোস্ট একটি জৈব সার যা উর্বরতা বাড়াতে ব্যবহার করা হয়। এক মাসের বাসি গোবর বা তরি-তরকারির ফেলে দেওয়া অংশ, ফলমূলের খোসা, উদ্ভিদের লতাপাতা, পশুপাখির নাড়িভুঁড়ি হাঁস-মুরগির বিষ্ঠা, ছোট ছোট করে কাটা খড়কুটো খেয়ে কেঁচো মল ত্যাগ করে এবং এর সাথে কেঁচোর দেহ থেকে এক ধরনের রাসায়নিক পদার্থ বের হয়ে যে সার তৈরি হয় তাঁকে কেঁচো কম্পোস্ট বা ভার্মি কম্পোস্ট বলা হয়। এ সার সব ধরনের ফসল ক্ষেতে ব্যবহার করা যায়। এটি পৃথিবীতে অধিক ব্যবহৃত জৈব সারের অন্যতম, পরিবেশবান্ধব সার।
        .
        ভার্মিকম্পোস্ট মাটিতে পানি ধারণ করার ক্ষমতা বৃদ্ধি করে এবং বায়ু চলাচল বৃদ্ধি পায়। ফলে মাটির উর্বরতা শক্তি বৃদ্ধি করে।
        মাটির পানি ধারণ ক্ষমতা বাড়ায় বিধায় কেঁচো সার ব্যবহারে সেচের পানি কম লাগে।
        ক্ষারীয় লবণাক্ত মাটিতেও চাষাবাদ সম্ভব।
        রোগ ও পোকামাকড়ের উপদ্রব কম হয়।
        আগাছার ঝামেলা কম হয়।
        ফসলের বীজের অংকুরোদগম ক্ষমতা বাড়ে।
        রাসায়নিক সারের চাইতে খরচ অনেক কম হয় এবং পরিবেশ দূষণমুক্ত থাকে।
        (৩)পার্লাইট
        .
        দেখতে সাদা নুড়ি পাথরের মতো। এর বদলে ভার্মিকুলাইট অথবা ইটের গুঁড়া বা ছোট পাথরের টুকরা ব্যবহার করা যায়।
        .
        পার্লাইট মূলত আগ্নেয়শিলা থেকে আসে। একে ভল্কানিক রক বা ভল্কানিক গ্লাসও বলা হয়।আগ্নেয়গিরির লাভা থেকে একে সংগ্রহ করা হয়। এরপর একে ছোট ছোট টুকরায় ভাগ করে ৮৫০°- ৯০০° সেলসিয়াস তাপমাত্রায় উত্তপ্ত করা হয়। ফলে ছোট ছোট এয়ার পকেট তৈরি হয় যার যেকারণে এটার সত্যিকারের সাইজ থেকে ১৫ গুণ বড় হয়। এজন্য খুবই নিমিষেই আঙুল দিয়ে গুড়ো করা যায়।
        কেন পটিং মিক্সে ব্যবহার করা হয়?
        .
        বাতাস ধারণ করে।
        পানি ধারণ করে।
        তাপমাত্রা ঠিক রাখে।
        অণুজীবের কার্যকারিতা বৃদ্ধি পায়।
        মাটি ঝুরঝুরে থাকে।
        ওজনে হালকা।
        শিকড় বৃদ্ধি পায়।
        pH ৬.৫-৭
        অতিরিক্ত পানি নিষ্কাষণ করে দেয় ফলে পানি বাহিত রোগ  সৃষ্টি হয় না।
        সতর্কতা অবলম্বন
        .
        যখন অর্গানিক বা জৈব পদার্থ নিয়ে কাজ করা হবে তখন মুখে মাস্ক পড়ে নিতে হবে।
        উপাদান গুলো মিশানোর সময় অবশ্যই হাতে গ্লোভস বা দস্তানা পরা উচিৎ।
        চোখকে  নিরাপদ রাখতে চশমা পরা উচিৎ।
        ডাস্টযুক্ত উপাদানের জন্য স্প্রে বোতল ব্যবহার করতে হবে।
        ঝড়ো আবহাওয়ায় পটিং মিক্স তৈরি থেকে বিরত থাকা।
        কাজ শেষে খুব ভালো করে হাত ধোঁয়া।
        পটিং মিক্স তৈরির পদ্ধতি
        ~৬০% কোকোপিট
        ~২০%ভার্মিকম্পোষ্ট
        ~১৫%পার্লাইট
        ~৫%নিম মিক্স
        .
        ধাপ-১
        .
        একটি বড় প্লাস্টিকের পাত্রে কোকোপিটের ব্লক নিয়ে তা ছোট টুকরো করে গরম পানি দিয়ে ভিজিয়ে নিতে হবে।ফলে কোকোপিট সম্পূর্ণ পানি টেনে নিয়ে ছোট্ট থেকে বড় হয়ে যাবে। হাত দিয়ে পরে তা ঝুড়ঝুড়ে করে দিতে হবে।
        .
        ধাপ-২
        .
        আলাদা আর একটা বড় পাত্র বা বালতিতে কোকোপিটের গুড়ো এবং ভার্মিকম্পোস্ট মিশিয়ে নিতে হবে। ভার্মিকম্পোস্ট মিশানোর আগে অবশ্যই সিভ বা চালুনি দিয়ে কম্পোস্ট চেলে নিতে হবে যাতে কোনো দলা না থাকে।
        .
        ধাপ-৩
        .
        এরপর এতে পার্লাইট যোগ করতে হবে।
        .
        ধাপ-৪
        .
        খুব ভালোভাবে উপাদান গুলো মিশিয়ে নিতে হবে হাতের গ্লোভস পরে।
        প্রয়োজনীয় টিপস
        .
        পটিং মিক্স তৈরির ক্ষেত্রে বড় কন্টেইনার নিতে হবে। অথবা ছাদে প্লাস্টিকের পেপার বিছিয়ে  নিয়েও পটিং মিক্স তৈরি করা যায়।
        কোকোপিট দ্রুত ভিজানোর জন্যে গরম পানি ব্যবহার করা উচিত।
        ডাস্টের মধ্যে মাইক্রোস্কোপিক সিলিকা থাকে ফুসফুসে অক্সিজেন গ্রহণে বাধা দেয়।তাই অবশ্যই বাসায় পটিং মিক্স তৈরির সময় মুখে মাস্ক পরে নিতে হয়।
        যদি বাইরে থেকে পটিং মিক্স কেনা হয় তাহলে লক্ষ্য করতে হবে প্যাকেটের গায়ে অস্ট্রেলিয়ান স্ট্যান্ডার্ডস মার্ক( AS 3743) আছে কিনা।
        
        `,
    },
    {
        title: 'একটি আদর্শ টব তৈরির কৌশল ও নিয়ম-কানুন',
        content: `
            ছাদে বাগান বা কোনো ফুল, ফলের গাছ লাগানোর অন্যতম প্রধান উপকরণ হলো টব। এই টবের ওপরই গাছটি বেড়ে ওঠবে, ফুল, ফলে বাগানীর মন ভরিয়ে তুলবে।
            তাই টবটি যেন একেবারে যুগপোযোগী ও যথার্থ হয় সেদিকে প্রথম নজর দিতে হবে। মনে রাখতে হবে টব ব্যবস্থাপনা যত ভালো হবে গাছটিও তত ভালোভাবে বেড়ে ওঠবে। পাঠক আসুন জেনে নেয়া যাক একটি আদর্শ টবের গুণবালী ও কোন বিষয়গুলো গুরুত্ব দিতে হবে।
            টবের টিপস: ফুল কিংবা ফল গাছ যাই হোক না কেন, টব ব্যবহার করার সময় লক্ষ রাখতে হবে, গাছের আকার কত বড় হবে। সেই মতো টবের আকার নির্ধারণ করতে হবে।
            পানি গড়িয়ে যাওয়ার জন্য টবের নিচে ছিদ্র থাকতে হবে। ছিদ্রের ওপর নারকেলের ছোবড়া বা ইটের টুকরো দিয়ে ঢেকে দিতে হবে। টবে ব্যবহারের আগে টবে ব্যবহার করা ছোবড়া বা ইটের টুকরো ভালোভাবে ধুয়ে নিতে হবে। গরম পানিতে ধুয়ে নিতে পারলে ভালো। যে গাছের চারা লাগানো হবে তা সাধারণ পানিতে ধুয়ে নিতে হবে। এর ফলে রোগের সংক্রমণ অনেক কমে যায়।
            চারা কেনার সময় অপেক্ষাকৃত ছোট আকারের চারা সংগ্রহ করা দরকার। গাছ বড় হলে প্রয়োজনে বড় টবে সাবধানে চারা স্থানান্তর করে নেওয়া যায়। তবে টব ভেঙে চারা গাছ বের করা যাবে না। মনে রাখতে হবে, চারা গাছটি যেন কোনোভাবেই আঘাত না পায়।
            টবের সার-মাটি: টবের গাছের খাদ্যপুষ্টি চাহিদা মেটানোর জন্য মাটিতে দরকারি সার মেশাতে হবে। মাটি, গোবর সার, কম্পোস্ট, পচা পাতা, পরিমাণমতো রাসায়নিক সার মেশাতে হবে। শুকনো দূর্বা ঘাস টবের মাটির মাঝামাঝি দিয়ে তার ওপরে মাটি দিয়ে চারা গাছ লাগানো ভালো। সূত্র: জাতীয় –তথ্যকোষ, কৃষি।
        `,
    },
    {
        title: 'ট্রাইকোডারমা ছত্রাক',
        content: `
            ট্রাইকোডারমা কি?
            ট্রাইকোডারমা এক প্রকার আণুবীক্ষণিক ছত্রাক যা সাধারণ ভাবে উর্বর মাটিতে থাকে। এটা বিভিন্ন ভাবে গাছ-পালার জন্য ক্ষতিকর ছত্রাক এবং নেমাটোড দমন করতে পারে যেমনঃ বিভিন্ন ধরনের অ্যান্টিবায়োটিক, টক্সিন, এনজাইম নিঃসরনের মাধ্যমে, দ্রুত বংশ বিস্তার করে ক্ষতিকর ছত্রাকের বংশ বিস্তার অবদমিত করে, পরজীবী হিসাবে অন্য ছত্রাককে আক্রান্ত করে ইত্যাদি উপায়ে। ট্রাইকোডারমা ছত্রাকের এই বিশেষ বিশিষ্টের কারনে এটি জৈব ছত্রাকনাশক বা বায়ো ফানজিসাইড হিসাবে কৃষিকাজে বা বাগানে ব্যাবহার করা হচ্ছে।
            গাছে কেন ব্যাবহার করবেন?
            ১। ছত্রাক এবং নেমাটোড দমনঃ এটি সরাসরি ক্ষতিকর ছত্রাক এবং নেমাটোড দমন করে কিন্তু রাসায়নিক ছত্রাকনাশকের মতো পরিবেশের কোন ক্ষতি করেনা।
            ২। গ্রোথ প্রমোটারঃ এটি মাটিতে থাকা মাইক্রো নিউট্রিয়েন্ট গাছের গ্রহন উপযোগী করে গাছের বৃদ্ধিতে সহায়তা করে।
            ৩। রোগ প্রতিরোধ ক্ষমতা তৈরিঃ এটি গাছকে বিভিন্ন ধরনের রোগের বিরুদ্ধে প্রতিরোধ ক্ষমতা তৈরিতে সাহায্য করে। চারা অবস্থায় এর প্রয়োগ ভবিষ্যতে গাছকে সুস্থ সবল রাখে।  
            ৪। বায়ো-ডিগ্রেডেশনঃ ট্রাইকোডারমা মাটিতে থাকা বিভিন্ন ক্ষতিকর রাসায়নিক যেমনঃ কীটনাশক নষ্ট করে মাটিকে উর্বর করে তুলতে সহায়তা করে।

            কিভাবে ব্যাবহার করবেন?
            ট্রাইকোডারমা দুই ভাবে ব্যাবহার করা যায়।
            এক, ট্রাইকোডারমা পাওডার পানিতে মিশ্রিত করে গাছে প্রয়োগ করে।
            দুই, জৈব সার বা কম্পস্টের সাথে মিশ্রিত করে মাটিতে প্রয়োগ করে।
            
            মাটি বাহিত রোগ যেমনঃ ফুসারিয়াম, পাইথিয়াম, রাইজোকটোনিয়া, রুট নেমাটোড ইত্যাদি আপনার গাছপালার জন্য বিরাট ক্ষতির কারন হতে পারে। ট্রাইকোডারমা এসব রোগের হাত থেকে গাছপালা রক্ষার সবচেয়ে উপযুক্ত অস্ত্র। তাই পরিবেশের এবং স্বাস্থের জন্য ক্ষতিকর রাসায়নিকের ব্যাবহার বন্ধ করে এই ধরনের জৈব ছত্রাকনাশক ব্যাবহার শুরু করা উচিৎ নয় কি?

        `,
    },
]