module.exports = [
    {
        title: "মাটি কাকে বলে এবং মাটির বৈশিষ্ট্য",
        content: `
        মাটির সংজ্ঞাঃ
        মৃৎবিজ্ঞানীগণ মাটির নানারূপ সংজ্ঞা দিয়েছেন, যেমনঃ
        (১) ভূ-পৃষ্ঠের নরম আবরনের নাম মৃত্তিকা
        (২) উদ্ভিদ জন্মানোর উপযোগী খনিজ, জীব ও জৈব সমন্বয়ে গতিশীল প্রাকৃতিক বস্তুকে মৃত্তিকা বলে
        (৩) সময়ের ব্যবধানে জলবায়ূ ও জৈব পদার্থের সমন্বিত প্রভাবে রূপান্তরিত উৎস শিলা সৃষ্ট গাছ জন্মানোর উপযোগী ভূ-পৃষ্ঠের প্রাকৃতিক বস্তর সমষ্টিকে মৃত্তিকা বলে
        (৪) পৃথিবীর উপরিভাগের যে নরম স্তরে গাছপালা মূল স্থাপন করে রস শোষণ করে জন্মায় ও বৃদ্ধি পায় তাকে মাটি বলে
        (৫) মাটি হচ্ছে কঠিন পদার্থের ছোট ছোট টুকরা, পানি ও বায়ুর সমন্বয়ে গঠিত যৌগিক পদার্থ
        (৬) পৃথিবীর শক্ত আবণের সবচেয়ে উপরের স্তরকে মাটি বলে।
        মাটির বৈশিষ্ট্য
        মাটির বৈশিষ্ট (Soil properties)
        মাটিতে বিদ্যমান কঠিন, তরল বা বায়বীয় পদার্থ যৌথভাবে একটি বিশেষ প্রকৃতি উৎপন্ন করে। মাটির এই প্রকৃতি প্রকাশের জন্য মাটির সকল বৈশিষ্ট্যকে নিম্নরূপ ৩টি শ্রেণীতে বর্ণনা করা হয়। যেমন-
        ক) মাটির ভৌত বৈশিষ্ট্য
        খ) মাটির রাসানিক বৈশিষ্ট্য
        গ) মাটির জৈবিক বৈশিষ্ট্য
        জমি চাষাবাদ, ফসল উৎপাদন ও মৃত্তিকা উর্বরতা ব্যবস্থাপনায় মাটির ভৌত রাসায়নিক ও জৈবিক ধর্মের প্রভাব খুব তাৎপর্যপূর্ণ।
        মৃত্তিকা বৈশিষ্ট্য প্রভাবিত কতগুলো কৃষিতাত্তিক প্রক্রিয়া নিচে উল্লেখ করা হলো।
        ১। বীজের অঙ্কুরোদ্গম
        ২। তাপমাত্রা ও বায়ুচলাচল
        ৩। পানি চলাচল ও ভুমি ক্ষয়
        ৪। উদ্ভিদ শিকড়ের বিসতৃতি ও প্রতিষ্ঠা
        ৫। অণুজৈবিক পরিবেশ নিয়ন্ত্রণ
        ৬। উদ্ভিদ ধারণ ও পুষ্টি সরবরাহ
         
        `
    },
    {
        title: "ফসল উৎপাদনে জৈব সারের গুরুত্ব",
        content: `
        জীব দেহ হতে প্রাপ্ত বা প্রস্তুত সারকে জৈব সার বলা হয়। অন্যভাবে বলা যায় যে, পশু পাখির মলমূত্র এবং গাছ পালা অবশিষ্টাংশ যা মাটির উর্বরতার রক্ষা ও ফসলের অধিক ফলনের জন্য ব্যবহার করা হয় তাহাই জৈব সার। গোবর সার, খামার জাত সার, কম্পোষ্ট, আবর্জনা সার, খৈল, সবুজ সার, ছাই প্রভৃতি বহুল প্রচলিত জৈব সার।
        জৈব সারের উপকারিতাঃ
        জৈব পদার্থ হচ্ছে মাটির প্রাণ। জৈব সার ব্যবহারে মাটিতে জৈব পদার্থের পরিমাণ বাড়ে।
        জৈব সার ব্যবহারে মাটির উর্বরতা বাড়ে। এতে ফসলের প্রধান খাদ্য নাইট্রোজেন,ফসফরাস, পটাশিয়াম ও অন্যান্য খাদ্য উপাদান থাকে ফলে অণুখাদ্যের ঘাটতিও পূরণ হয়।
        মাটির গঠন ও গুণাগুণ উন্নত করে। বেলে মাটি সরস হয়, পানি ধারণ ক্ষমতা বাড়ে, তাছাড়া এঁটেল মাটিকে কিছুটা দো-আঁশ ভাবাপন্ন করে ফসল জন্মানোর অধিক উপযোগী করে তোলে।
        মাটিতে জৈব সার ব্যবহারের পর ধীরে ধীরে গাছের প্রয়োজন অনুযায়ী অনেক দিন ধরে তা গ্রহন করতে পারে। জমিতে প্রয়োগের পর আনুমানিক ৬ -১৮ মাস ব্যাপী এর প্রভাব থাকতে পারে। এতে পরবর্তী ফসলেও কাজে লাগে।
        জৈব সার ব্যবহারে মাটির উপকারী জীবাণুর ক্রিয়া বেড়ে যায় এবং এদের বংশ বিসত্মারেও সহায়ক হয়। এতে সহজতর উপায়ে গাছ মাটি থেকে খাদ্য উপাদান গ্রহন করে দ্রুত বড় হতে পারে।
        জৈব সার গাছের শিকড় ও অংগজ বৃদ্ধিতে সহায়তা করে। কেচোঁ, পিঁপড়ে, উই পোকা জৈব পদার্থ প্রয়োগ কৃত মাটিতে গর্তের সৃষ্টি করে। এতে শিকড় বেশী পরিমানে অক্সিজেন পাবার সম্ভাবনা থাকে এবং মাটিতে বায়ু চলাচলে সাহায্য করে। ফলে গাছ সতেজ হয়ে উঠে।
        বৃষ্টিপাত জনিত আঘাতের ফলে ও বায়ু প্রবাহজনিত ভূমি ক্ষয় সাধনের মাত্রা কমিয়ে দেয়।
        গ্রীষ্মকালে মাটিতে তাপমাত্রা কমিয়ে দেয় এবং শীতকালে উষ্ণ রাখতে সহায়তা করে। এতে সব ঋতুতেই গাছের শিকড় বৃদ্ধি পেতে পারে।
        মাটিতে রস মজুদ রাখতে সাহায্য করে এবং পানি সহজলভ্য হয়। ফলে সেচের পানির অধিক সদ্ব্যবহার হয়।
        জৈব সার রাসায়নিক সারের কার্য়কারিতা বাড়াতে সাহায্য করে এবং জৈব সার ব্যবহার করলে আণুপাতিক হারে রাসায়নিক সারের মাত্রা কমানো যায়।
        মাটিতে কীটনাশক ওষুধ ও রাসায়নিক সারের আধিক্যজনিত কোন বিষাক্ততা সৃষ্টি হলে জৈব সার ঐ বিষাক্ততা কমাতে সাহায্য করে। জৈব সার বেশী ব্যবহার করলেও মাটির কোন ক্ষতি হয়না।
        জৈব সার ফসলের উৎপাদন বৃদ্ধি করে, এবং গুণগত মান বাড়ায় এবং গুদামজাত শস্যের সংরক্ষণ ক্ষমতা বৃদ্ধি করে।
        যতই মাটিতে জৈব পদার্থ বেশী থাকবে ততই মাটির উৎপাদন ক্ষমতা অধিক হবে। সুতরাং যথাসম্ভব অধিক হারে জৈব সার ব্যবহারের প্রচেষ্টা চালানো উচিত।
                 
        `
    },
    {
        title: "মাটির রস সংরক্ষণে মালচিং",
        content: `
        বিভিন্ন ধরনের বস্তু দিয়ে যখন গাছপালার গোড়া, সবজি ক্ষেত ও বাগানের বেডের জমি বিশেষ পদ্ধতিতে ঢেকে দেয়া হয় তখন তাকে বলে মালচ। আর এ পদ্ধতিটি কে বলে মালচিং।
        ক) ফসলের ক্ষেতে আর্দ্রতা সংরক্ষণে মালচিং বিশেষভাবে উপকারী, কারণ এ প্রযুক্তি ব্যবহারে ফসল ক্ষেতের পানি সূর্যের তাপ ও বাতাসে দ্রুত উড়ে যায় না। ফলে জমিতে রসের ঘাটতি হয় না এবং সেচ লাগে অনেক কম। মালচিং ব্যবহার করলে জমিতে প্রায় ১০ থেকে ২৫ ভাগ আর্দ্রতা সংরক্ষণ করা সম্ভব হয়।
        খ) মালচিং করার জন্য যেসব মালচ উপাদান ব্যবহার করা হয় সেগুলো হলো জৈব ও অজৈব পদার্থ। উপাদানগুলো হলো-ধান বা গমের খড়, কচুরিপানা, গাছের পাতা, শুকনা ঘাস, কম্পোস্ট, ভালোভাবে পচানো রান্নাঘরের আবর্জনা ইত্যাদি বিশেষভাবে উল্লেখযোগ্য।
        গ) গাছের গোড়া, সবজির বেড এবং ফলবাগানে গাছের গোড়া হতে এক থেকে দু’ইঞ্চি (২.৫০-৫.০ সে.মি) দূরে বিভিন্ন ধরনের মালচ ব্যবহার করা যেতে পারে। মালচিংয়ের কাজে ব্যবহৃত বিভিন্ন পদার্থ অবশ্যই ৫ সেন্টিমিটার (২ইঞ্চি) এর বেশি পুরু করে দেয়া ঠিক নয়।
        ঘ) উল্লেখ্য যে, মালচিং পদার্থের পুরুত্ব বেশি হলে তা গাছপালার অনাকাঙ্খিত মূল গজাতে সহায়তা করবে। এমনকি সঠিক মালচিং প্রয়োগে বিভিন্ন ধরনের পোকামাকড়ের আক্রমণও রোধ করা যায়।
        ঙ) শীতকালে মালচ ব্যবহার করলে মাটিতে প্রয়োজনীয় তাপমাত্রা ধরে রাখা সম্ভব হয় এবং গরমকালে মাটি ঠান্ডা থাকে, এমনকি বেশ কিছু পোকামাকড়ের আক্রমণও রোধ করা যায়।
        চ) সবচেয়ে বড় কথা মালচিং প্রযুক্তি ব্যবহার করলে পানি লাগে অনেক কম। সেচ খরচ বাঁচে, লাভ হয় বেশি।
        ছ) পাহাড়ি এলাকা এমনকি টিলা, পাহাড়ের ঢালে বিশেষ করে লালমাটি এলাকায় স্বল্প খরচে মালচিং প্রযুক্তি ব্যবহারের কোনো বিকল্প নেই। ফল গাছ বিশেষ করে লেবু, পেয়ারা, কাঁঠাল, আম, নারিকেল, কলা, কমলা, আনারস, বাতাবি লেবু, পেঁপে, আদা, হলুদ এসব গাছের গোড়ায় মালচিং দিয়ে সম্ভব হলে ১-২ সপ্তাহ পর একবার পানি দিয়েও বেশি সময় রস সংরক্ষণ করা সম্ভব।
        
        `
    },
    {
        title: "কিভাবে তৈরি করবেন কেঁচো কম্পোষ্ট",
        content: `
        কেঁচো কম্পোষ্ট (ভার্মি কম্পোষ্ট) প্রস্তুত পণালী
        প্রধানত কেঁচো উপরের মাটি নিচে এবং নিচের মাটি উপরে তুলে থাকে। এসব কাজের সাথেই কেঁচোর সারও তৈরি হয়। কেঁচোর দ্বারা জৈব সার তৈরির জন্য এর সাথে তরকারির খোসা, গরু-ছাগল ও হাঁস-মুরগীর বিষ্ঠা, নাড়ি-ভুঁড়ি, পাতাসহ পচা আবর্জনারও প্রয়োজন হয়।
        (১) কেঁচো কম্পোষ্ট তৈরি করতে হলে প্রথমে গর্র্ত তৈরি করতে হয়। এরপর এসব গর্তে ঘাস, আমের পাতা বা খামারের ফেলে দেয়া অংশ এসবের যেকোনো একটি ছোট ছোট করে কেটে এর প্রায় ২৫ কেজি হিসেবে নিতে হয়।
        (২) তবে এসব আবর্জনা গর্তে ফেলার আগে গর্তের তলদেশসহ চারপাশে পলিথিন দিয়ে মুড়ে দিতে হবে। এতে করে গর্তের কেঁচো পিট থেকে বাইরে যেতে পারবে না।
        (৩) কেচোঁ কম্পোস্ট তৈরির জন্য প্রথমেই পলিথিন বিছানোর পরে গর্তের নিচে ৬ ইঞ্চি পুরু করে বেড বানাতে হবে। এই বেড তৈরির জন্য ভালো মাটি ও ও গোবর সমপরিমাণে মিশাতে হবে এবং এসব মিশানো গাবর ও মাটি পরে কেঁচোর খাবার হিসেবে ব্যবহৃত হয়।
        (৪) সাধারণত এসব কম্পোস্ট তৈরির কাজে দুই ধরণের কেঁচোর জাত রয়েছে। তাহলো- ‘এপিজিক’ ও ‘এন্ডোজিক’ নামের।
        ‘এপিজিক’ জাতগুলো দেখতে লাল রঙের। এরা মাটির উপরের স্তরেই বিচরণ করে থাকে।
        অপরদিকে ‘এন্ডোজিক’ জাতগুলো প্রধানত ছাই রঙের হয়ে থাকে। এরা সাধারণত সার উৎপাদন করতে পারে না তবে এরা মাটির ভৌত ও জৈব গুণাবলির উন্নতি করতে পারে।
        (৫) কেঁচো কম্পোষ্ট তৈরির জন্য গর্ত গোবর ও মাটি দিয়ে ভর্তি করার পর ২ মিটার দৈর্ঘ্য ও ১ মিটার প্রস্থ মাপের পিটে ৩০০ টি কেঁচো প্রয়োগ করতে হয়। কেঁচো প্রয়োগের পর ২ ইঞ্চি জৈব সার এবং তার উপর ৪ ইঞ্চি কাঁচা পাতা দিতে হবে। গর্তের উপরিভাগ পাটের ভিজানো চট দিয়ে ঢেকে দিতে হবে এবং প্রতিদিন ২ বার পানি ছিটিয়ে দিতে হবে। কাঁচা পাতা কালো বর্ণ ধারণ করলে পানি দেয়া বন্ধ করতে হবে। ৪ সপ্তাহ পরে পুণরায় কাঁচা পাতা দিতে হবে এবং চট দিয়ে ঢেঁকে ভিজাতে হবে। এবার ৪ দিন পর পর কাঁচা পাতা দিতে হবে। ৬ সপ্তাহ পরে নেটে চেলে কেঁচো আলাদা করে সার ব্যবহার বা বাজারজাত করা যাবে। কেঁচো সারের গুণগত মান বজায় রাখার জন্য গর্তের উপরিভাগে ছায়া প্রদানের ব্যবস্থা করা খুবই জরুরি।
        (৬) এসব কেঁচো যে সব খাবার খায় তা গর্তে নিয়মিত ভাবে সরবরাহ করতে হবে।
        কেঁচোর খাবারের মধ্যে রয়েছে স্থানীয় ঘাস, খামারজাত পদার্থ, আঁখের ও কলার ফেলে দেয়া অংশ ইত্যাদি।
        (৭) গবেষণায় দেখা গেছে একটি আদর্শ ভার্মিকম্পোস্টে ১.৫৭% নাইট্রোজেন, ১.২৬% ফসফরাস, ২.৬০% পটাশ, ০.৭৪% সালফার, ০.৬৬% ম্যাগনেশিয়াম, ০.০৬% বোরণ, ১৮% জৈব কার্বন, ১৫-২৫% পানি ও সামান্য পরিমাণ হরমোন রয়েছে। সাধারণত পিঁপড়া, উঁইপোকা, তেলেপোকা, মুরগি, ইঁদুর, পানি এসব কেঁচোর বড় শত্রু প্রতি লিটার পানিতে ১০০ গ্রাম গুঁড়ামরিচ, ১০০ গ্রাম হলুদের গুঁড়া ও সামান্য লবণ মিশিয়ে পিটের বাইরে চারিদিকে ছিটিয়ে দিলে এসব শত্রু দমন থাকে।
        কেঁচোর উপকারিতা
        ১। কেঁচো মরা, আধাপচা বাসি লতা পাতা খায় এবং মাটি মিশ্রিত জৈব দ্রব্য খেয়ে মাটিতে জৈব পদার্থ দান করে।
        ২। কেঁচো দেড় মিটার পর্যন্ত গভীরতা থেকে গর্ত খনন করে মাটি আলোড়িত করে। এতে নিচু স্তরের মাটির উর্বরতা বাড়ে।
        ৩। উপযুক্ত পরিবেশে পর্যাপ্ত কেঁচো থাকলে প্রতি শতক জমিতে ৩০-৪০ কেজি মাটি পর্যায়ক্রমে ভক্ষন, মল ত্যাগ ও আলোড়িত করতে পারে।
        ৪। কেঁচোর মল মাটির উর্বরতা বাড়ায়। সাধারন মাটির চেয়ে কেঁচোর মলে উদ্ভিদ পুষ্টির পরিমান বেশি থাকে।
        ৫। কেঁচোর চলাচলে মাটিতে বায়ু চলাচল, পানির অনুপ্রবেশ ও শিকড়ের বৃদ্ধি ঘটে।
        
        `
    },
    {
        title: "কোকোডাস্ট দিয়ে জৈব সার তৈরি",
        content: `
        বাংলাদেশে নারিকেলকে বলা হয় গ্রামীণ অর্থনীতির চালিকা শক্তি। ঐতিহ্যগতভাবে এদেশে নারিকেল চাষ হয় বাড়ির আঙিনায়। নারিকেল চাষে তাই বাড়তি কোনো জায়গা জমির দরকার হয় না। নারিকেল গাছের ছায়া বসতবাড়িতে সাথী ফসল হিসেবে অন্যান্য ফল ও শাকসবজি চাষ করতেও সহযোগিতা করে। রোপণ করার ৬-৭ বছর পর ফল আসে এবং বিরামহীনভাবে ৫০-৬০ বছর তা চলতে থাকে। বিস্ময়কর এ ফলদ বৃক্ষের ফুল, ফল, কাণ্ড পাতা বছরব্যাপী কোনো না কোনোভাবে আমাদের আর্থিক সহযোগিতা প্রদান করে থাকে। কৃষকের কাছে তাই নারিকেল সবচেয়ে সমাদৃত গাছ। নারিকেল থেকে উত্তম পুষ্টিগুণ সম্পন্ন ডাবের পানি পাওয়া যায়। নারিকেলের ছোবড়া থেকে আঁশ এবং আঁশজাত দ্রব্য তৈরি করা যায়। সবশেষে নারিকেলের তুষ (কোকোডাস্ট) থেকে ভালোমানের জৈব সার তৈরি হয়ে থাকে। বরিশাল অঞ্চলের স্বরূপকাঠি (পিরোজপুর), খুলনার ফুলতলা, বাগেরহাট ও যশোর জেলার মনিরামপুর অঞ্চলে নারিকেলের ছোবড়া বা খোসা থেকে বংশানুক্রমে নারিকেলের খোসা, আঁশ ও আঁশজাত দ্রব্য করা হয়ে থাকে।
        নারিকেলের খোসা
        নারিকেলের খোসা থেকে আঁশ তৈরির সময় খোসার ৬৬% তুষ বা Cocodust বের হয়। নারিকেলের তুষে ৩১% সেলুলোজ ও ২৭% লিগনিন জাতীয় জৈব পদার্থ আছে এবং এর কার্বন ও নাইট্রোজেনের অনুপাত ১০৪:১ (Shekar, 1999)। সেলুলোজ খুব শক্ত বা Stable পদার্থ এবং এ কারণে নারিকেলের তুষ ১০-১৫ বছর পরও মাটিতে অক্ষতাবস্থায় থাকে। লিগনিন পচন-সৃষ্টিকারী ব্যাকটেরিয়া বা অনুজীবের কার্যক্ষমতা কমায়। নারিকেলের তুষে উদ্ভিদের প্রয়োজনীয় সব রকম পুষ্টি থাকে বলে তুষ পচালে উৎকৃষ্ট জৈব সারে রূপান্তরিত হয়। ভারত, শ্রীলংকা, ইন্দোনেশিয়া ও ফিলিপাইনে নারিকেলের তুষের সাথে চুন (প্রতি ১০০০ কেজি তুষে ৫ কেজি চুন) ও মাশরুম স্পন (Spawn) বা বীজ মিশিয়ে পচানো হয়। নারিকেলের তুষের মধ্যে মাশরুম চাষ করেও তা পচানো যায়। মাশরুমে ক্লোরোফিল না থাকায় সূর্যের আলো ব্যবহার করে খাদ্য উৎপাদন করতে পারে না। দৈহিক বাড়-বাড়তির জন্য মাশরুম নারিকেলের তুষের সেলুলোজ হতে শর্করা জাতীয় খাদ্য সংগ্রহ করে, ফলে নারিকেলের তুষের সেলুলোজ কঠিন পদার্থ হতে সরলতম পদার্থে রূপান্তরিত হয় ও সহজে পচে যায়। তুষে মাশরুম spawn ও চুন প্রয়োগ করলে ১ মাসের মধ্যে হিউমাস জাতীয় কালো পদার্থে পরিণত হয়। হিউমাস রাসায়নিক সারের মতো পুষ্টি সমৃদ্ধ নয়, তবে মাটিতে দীর্ঘদিন সক্রিয় থেকে মাটির অনুজীবের কার্যক্ষমতা বাড়ায়, মাটির ভৌত গুণাবলি ধরে রাখে এবং গাছের জন্য প্রয়োজনীয় মুখ্য ও গৌণ সব ধরনের খাদ্য সরবরাহ নিশ্চিত করে। হিউমাস মাটির Ca++, Zn++, Cu++ Fe++ ধাতব আয়ন ধরে রাখতে সাহায্য করে। এসব আয়নগুলো গাছের আয়ন বিনিময় ক্ষমতা বাড়ায়, মাটি থেকে খাদ্য সংগ্রহ করার ক্ষমতা বাড়ায় এবং ক্ষতিকর ফ্রি-রেডিকেল অপসারণ করে গাছের বৃদ্ধি নিশ্চিত করে। ফ্রি-রেডিকেল এক ধরনের ক্রিয়াশীল যৌগমূলক যা গাছের ক্লোরোফিল নষ্ট করে দেয়। গাছের স্বাভাবিক রেচন প্রক্রিয়া (Metabolism) থেকেই ফ্রি-রেডিকেল তৈরি হয়। জমিতে বেশি বেশি রাসায়নিক সার ব্যবহার করলে ফ্রি-রেডিকেলও বেশি তৈরি হয়। ফল জাতীয় সবজি যেমন টমেটো, করলার ক্ষেত্রে ফ্রি-রেডিকেলের কারণে একবার ফল আসলেই গাছের পাতা শুকিয়ে মারা যায়। এসব ধাতব আয়ন গুলো Super oxide dismutage (SOD) নামে এক ধরনের এনজাইম তৈরির মাধ্যমে ফ্রি-রেডিকেলের বিরুদ্ধে প্রতিরোধ গড়ে তোলে।
         
        নারিকেলের তুষের বিশেষ গুণ হচ্ছে ওজনের ৮-১০ গুণ পানি ধারণক্ষমতা। তাই সঠিক ব্যবহার পদ্ধতি জানা থাকলে নারিকেলের অব্যবহৃত এ তুষ সরাসরি নার্সারি ব্যবসা ও ফুল চাষে ব্যবহার করে যায়। বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউটের উদ্যানতত্ত্ব গবেষণ কেন্দ্র যশোরের কর্মরত বিজ্ঞানীরা ২০০৮ সালে যশোর শহরতলীর চাচড়া এলাকায় কোকো ফাইবার মিল নামক কোম্পানির সহায়তায় নারিকেলের আঁশ তৈরি ও তুষ পচানোর ওপর এক গবেষণা পরিচালনা করেন। ওই গবেষণায় বিজ্ঞানীরা মাশরুমের বীজ ও চুন প্রয়োগ করে দ্রুত নারিকেলের তুষ পচানোর পদ্ধতি আবিষ্কার করেন। হাইড্রোলিক মেশিনে নারিকেলে তুষের ব্লক তৈরি করে তাতে চারা লাগানোর ওপরও বিজ্ঞানীরা গবেষণা করেন।
        নারিকেল থেকে জৈব সার তৈরি
        নারিকেলের তুষ ফলের অংশ হওয়ায় গাছের বৃদ্ধির জন্য দরকারি সব পরিমাণ পুষ্টি বিশেষ করে পটাশিয়াম জাতীয় পদার্থ থাকে। পচানোর পর মাটিতে প্রয়োগ করলে মাটির পানি ধারণক্ষমতা ও অন্যান্য ভৌতিক গুণাবলি বৃদ্ধিসহ অনুজীবের কার্যক্রম বৃদ্ধি করে দীর্ঘমেয়াদে গাছের পুষ্টি সরবরাহ ও বৃদ্ধি-সহায়তা প্রদান করে। তাছাড়া নারিকেল থেকে তৈরি জৈব সারে আছে অনেক রকমের এনজাইম (Enzyme) ও কোষীয় পদার্থ যা শিকড় দিয়ে গাছের মধ্যে প্রবেশ করে ও গাছের রোগ প্রতিরোধ ও পোকার আক্রমণ প্রতিহত করার বাড়তি ক্ষমতা প্রদান করে। নারিকেল থেকে তৈরি জৈব সারে আছে ৬০৭৫% জৈব পদার্থ, ০.৭৬/ নাইট্রোজেন, ০.৪% হারে ফসফরাস ও পটাশ, ০.২% সালফার ও ০.০০৪ বোরন।
        কোকোপিটের ব্যবহার
        ০ ক্রমবর্ধমান হাইড্রোপোনিকউপায়ে সবজি চাষের জন্য কোকোপিট ব্যবহার করা হয় যেন কোনোভাবেই গাছ বা চারা ক্ষতিগ্রস্ত না হয়;
        ০ কোকোপিট উদ্ভিদের শিকড় উন্নয়নের জন্য একটি চমৎকার স্তর এবং গাছ বা চারা রোপণ করার সময় কোনো এজেন্ট প্রয়োজন হলে জৈব সারের সাথে কোকোপিটের সংমিশ্রণে একটি গ্রোয়ার মিডিয়া তৈরি করে সরাসরি চারা তৈরি করা যেতে পারে;
        ০ কোকোপিট মাটির তুলনায় অনেক হালকা এবং টবে ব্যবহারের সময় খুব সহজেই কোকোপিটের ভেতর বাতাস চলাচল করতে পারে যার ফলে গাছ বেশি বেশি অক্সিজেন নিতে পারে;
        ০ কোকোপিট শোষক সময়কাল অনেক : ফলে এটা গাছে ধীরে ধীরে শোষিত হয়;
        ০ কোকোপিট একটি উচ্চ বাফার ক্ষমতাসম্পন্ন জৈব পদার্থ যা মাটির গুণাগুণ বজায় রাখতে বিশেষভাবে সহায়তা করে থাকে। কাকোপিটের পিএইচ (pH) সবসময় ৫.৫ থেকে ৭ থাকে যা সুস্থ উদ্ভিদ তৈরি করে এবং খুব সহজেই উন্নত মানের গাছপালা তৈরি করতে সাহায্য করে এবং এর ফলে অনেক বেশি পরিমাণে ফসল সংগ্রহ করা যায়;
        ০ টবে মাটি ব্যবহার করলে ওজন বেশি হয়, কিন্তু কোকোপিট ব্যবহার করলে কম হয়। ছাদের ওপর অনেক টব ব্যবহার করলে লোড ক্যাপাসিটি কম হয়;
        ০ কোকোপিট দিয়ে যে কোনো প্রকার চারা তৈরি বা গাছ লাগানো যেতে পারে, নির্দিষ্ট কোনো ধরা বাঁধা নিয়ম নেই। আধুনিক গ্রিন হাউসে কোকোপিটকে বিভিন্নভাবে ব্যবহার করে ফসল উৎপাদন করে থাকে;
        ০ কোকোপিট দিয়ে টবে গাছপালা লাগালে দ্রুত বৃদ্ধি পায় এবং পানি দিলে টবের ভেতর কখনও জলাবদ্ধতা তৈরি হয় না, পানি সাথে সাথে দ্রুত সব জায়গাতে ছড়িয়ে দেয় এবং নির্দিষ্ট পরিমাণমতো পানি ধরে রেখে গাছকে সতেজ রাখে এবং কখনও পানি আবদ্ধ হয়ে গাছ মারা যায় না ।
        নিত্যপ্রয়োজনীয় সব চাহিদার জোগান দিলেও আমাদের দেশে নারিকেল অনেকটা অবহেলিত রয়ে গেছে। নারিকেল গবেষণা ও সম্প্রসারণ কার্যক্রম জোরদার করার মাধ্যমে নারিকেলের ফলন ও উৎপাদন বাড়ানো জরুরি। একই সাথে নার্সারির চারা তৈরি কলম লাগানোর ক্ষেত্রে কোকোডাস্ট নতুন সম্ভাবনা নিয়ে এসেছে। একে কাজে লাগিয়ে কৃষিকে আরও সমৃদ্ধ করতে হবে।
        
        `
    },
    {
        title: "ঘরেই তৈরী করে ফেলুন “হাড়ের গুড়ো”",
        content: `
        ভেজাল আর ভেজাল, ভেজালের দুনিয়ায় পৃথিবী বিষাদময়। গাছের জন্য অতিব প্রয়োজনীয় দুটো উপাদান নাইট্রোজেন এবং ফসফরাসের যোগান আসে হাড়ের গুড়ো থেকে। আর সেই অতীব প্রয়োজনীয় হাড়ের গুড়োতে এক শ্রেনীর অসাধু ব্যবসায়ীরা পাথরের গুড়ো মিশিয়ে বিক্রয় করে তাদের আখের গুছাচ্ছে। ফলে ক্ষতিগ্রস্হ হচ্ছে সবাই।
        আর তাই কিভাবে অতি সহজে ঘরে হাড়ের গুড়ো তৈরী করতে পারেন তার সহজ পদ্ধতিটি বলছি আজ।
        উপকরন…
        ১. হাঁস/ মুরগী/ টার্কির হাড়
        ২. স্টিলের ছুড়ি
        ৩. টিস্যূ পেপার
        ৪. লোহার হামান দিস্তা অথবা লোহার হাতুড়ি
        ৫. স্টীলের বাটি
        ৬. চপিং ডিস
        ৭. চশমা
        ৮. হেন্ড গ্লাভস
        হাড়ের গুড়ো তৈরীতে গরুর হাড় সবচেয়ে ভাল কিন্তু ঘরে তা তৈরী করা কষ্টদায়ক বিধায়, আমি গৃহস্হালীর উচ্ছিষ্ট থেকে প্রাপ্ত উপাদান দিয়েই হাড়ের গুড়ো করার পদ্ধতি নিয়ে বলব।
        হাড়ের গুড়ো তৈরী পদ্ধতি…
        ১. প্রথমে একটি স্টীল/ সিলভারের পাত্রে পানি দিয়ে গৃহস্হালীর উচ্ছিষ্ট থেকে সংগ্রহ করা হাড়গুলো (হাঁস/ মুরগী/ টারকি) ২০ মিনিট ধরে সিদ্ধ করতে হবে।
        ২. পানি ঠান্ডা হলে হাড়গুলোকে পানি থেকে উঠিয়ে টিস্যু পেপার দিয়ে ভাল করে মুছে শুষ্ক করে নিতে হবে।
        ৩. এর পর হাড়গুলোকে জীবানুমুক্ত এবং পরিস্কার একটি চপিং ডিসের উপর রেখে স্টিলের ছুড়ি দিয়ে হাড়ের গা চেছে, লেগে থাকা অতিরিক্ত মাংসের উচ্ছিষ্ট আলাদা করতে হবে। সতর্কতা হিসেবে এ সময় অবশ্যই হেন্ড গ্লাভস পরে নিতে হবে।
        ৪. হাড়গুলোকে এখন একটি স্টীলের প্লেটে সাজিয়ে রোদে রেখে আসতে হবে যেখানে প্রতিদন ৪-৫ ঘন্টা কড়া রোদ পড়ে এমন স্হানে। এভাবে রোদে রাখতে হবে ১০দিন। এ পক্রিয়া চলাকালিন হাড়গুলোকে মশারীর নেট দিয়ে ঢেকে দিতে হবে যাতে এর গায়ে কোন প্রকার কীট পতঙ্গ বসতে না পারে।
        ৫. এবার লোহাড় হামান দিস্তা কিংবা ভারী কোন স্টীলের পাত্রে ভাড়ী লোহার হাতুড়ি দিয়ে হাড়গুলো গুড়ো করা শুরু করতে হবে। হাড়ের গুড়োগুলো কোনভাবেই এক ইন্চির অধিক হবে না। সতর্কতা হিসেবে অবশ্যই চোখে চশমা পড়ে নিতে হবে নতুবা হাড়ের ক্ষুদ্র কণা চোখে ঢুকে ক্ষতি করতে পারে।
        
        `
    },
    {
        title: "নিম পাতা থেকে প্রাকৃতিক কীটনাশক তৈরি",
        content: `
        নিম পাতা থেকে শক্তিশালী কীটনাশক তৈরি করা যায় । নিম পাতা থেকে কীটনাশক তৈরির ধাপ গুলো এখানে বিস্তারিত ভাবে আলোচনা করা হয়েছে। প্রায় সব ধরনের পোকা মাকর দমনে নিম পাতার তৈরি কীটনাশক ব্যবহার করা যায় । বিশেষ করে বিটল , সাদা মাছি , বিছা পোকা , জবপোকা ইত্যাদি। এই কীটনাশক প্রয়োগ করে সম্পূর্ণ বিষমুক্ত ও প্রাকৃতিক উপায়ে ফল ফসল উৎপাদন করা সম্ভব। শুধু মাত্র নিমের পাতাই নয় নিমের বীজ থেকে , বীজ থেকে তৈরি তেল ও এর ফল থেকে ও তৈরি করা সম্ভব এই কীটনাশক।
        নিম পাতা থেকে কীটনাশক তৈরি করার নিয়ম :
        প্রথমে নিম পাতা সংগ্রহ করে পরিস্কার করে নিতে হবে। এরপর ১০ কেজি ওজনের পাতা একটি পাত্রে প্রয়োজন মত পানি নিয়ে পাতা সহ সেদ্ধ করে নিতে হবে সেদ্ধ করার সময় পাত্রটি ঢাকনা দিয়ে ঢেকে দিতে হবে। এবং সেদ্ধ করার পর পাএটিকে ১২ ঘন্টা একই ভাবে ডেকে রাখতে হবে। ১২ ঘন্টা পর একটি ছাঁকনি দিয়ে নিমপাতা সেদ্ধ করা নির্যাস যুক্ত পানি ছেঁকে নিতে হবে । এবার দ্রবণ টি সংগ্রহ করে রাখার জন্য প্রস্তুত হয়েছে। দ্রবণটি ফ্রিজে রেখে ২-৩ মাস পর্যন্ত সংগ্ৰহ করে রাখা যায়।
        নিমের বীজ থেকে কীটনাশক তৈরি করতে চাইলে প্রথমে বীজ গুরো করে নিতে হবে। বাকি সব নিয়ম কানুন ও পরিমান একই থাকবে।
        ব্যাবহার মাত্রা :
        ব্যবহার করার সময় প্রতি ১০ লিটার পানিতে ৫ থেকে ১০% হারে তৈরি করা দ্রবণটি ব্যবহার করতে হবে । তবে পোকার আক্রমণ বেশি হলে বেশি পরিমাণে ও ব্যবহার করা যায়। এতে কোন পার্শ্ব প্রতিক্রিয়া নেই। এই মিশ্রণটির সাথে কিছু পরিমানে সাবানের ফেনা ব্যবহার করলে এর কার্যকারিতা অনেক বেড়ে যায়।
        প্রাকৃতিক উপায়ে তৈরি এই কীটনাশক ব্যবহার করে খুব সহজেই বিষ মুক্ত শাক সবজি ও ফলমূল উৎপাদন করা সম্ভব হবে। অনেকেই নিজেদের বাড়িতে বাগান করে ফল ও সবজি চাষ করে । কিন্তু তারা কোন রাসায়নিক কীটনাশক ব্যবহার করতে চান না। তাই উপরে বর্ণিত পদ্ধতিতে নিম পাতা থেকে কীটনাশক তৈরি করে তা ব্যবহার করে তারা খুব সহজেই বাড়িতে ও ছাদে বিষমুক্ত সবজি উৎপাদন করতে পারবেন।
        
        
        `
    },
]